<?php
/**
 *  @Created By CatPocket PhpCacheServer
 *  @Time:2012-05-12 02:50:20
 */

if(filemtime(__FILE__) + 1800 < time())return false;

return array (
  0 => 
  array (
    'cids' => 
    array (
      0 => 1270,
      1 => 1,
      2 => 21,
      3 => 73,
      4 => 134,
      5 => 57,
      6 => 162,
      7 => 221,
      8 => 172,
      9 => 185,
      10 => 206,
      11 => 1239,
      12 => 1259,
      13 => 1233,
      14 => 1224,
      15 => 1249,
      16 => 2150,
      17 => 1254,
      18 => 189,
      19 => 173,
      20 => 1477,
    ),
  ),
  2 => 
  array (
    'name' => '潮女上装',
    'pid' => '1',
    'cids' => 
    array (
      0 => 1283,
      1 => 1279,
      2 => 1277,
      3 => 1287,
    ),
  ),
  35 => 
  array (
    'name' => '型男上装',
    'pid' => '21',
    'cids' => 
    array (
      0 => 2085,
      1 => 1294,
      2 => 1291,
      3 => 1293,
      4 => 1292,
      5 => 1302,
    ),
  ),
  58 => 
  array (
    'name' => '女生内衣',
    'pid' => '57',
    'cids' => 
    array (
      0 => 1412,
      1 => 1413,
      2 => 1414,
      3 => 1415,
      4 => 1419,
      5 => 1420,
    ),
  ),
  92 => 
  array (
    'name' => '魅力女鞋',
    'pid' => '73',
    'cids' => 
    array (
      0 => 1307,
      1 => 1308,
      2 => 1309,
      3 => 1310,
      4 => 1311,
      5 => 1312,
    ),
  ),
  135 => 
  array (
    'name' => '美容护理',
    'pid' => '134',
    'cids' => 
    array (
      0 => 1381,
      1 => 1382,
      2 => 1383,
    ),
  ),
  165 => 
  array (
    'name' => '益智玩具',
    'pid' => '162',
    'cids' => 
    array (
      0 => 1604,
      1 => 1605,
      2 => 1606,
      3 => 1607,
      4 => 1608,
      5 => 1609,
      6 => 1610,
      7 => 1611,
      8 => 1612,
      9 => 1613,
      10 => 1614,
      11 => 1615,
    ),
  ),
  175 => 
  array (
    'name' => '个人护理',
    'pid' => '1230',
    'cids' => 
    array (
      0 => 1424,
      1 => 1425,
      2 => 1426,
      3 => 1427,
      4 => 1428,
      5 => 1429,
      6 => 1430,
      7 => 1431,
    ),
  ),
  208 => 
  array (
    'name' => '酒水茶饮',
    'pid' => '206',
    'cids' => 
    array (
      0 => 1697,
      1 => 1664,
      2 => 1665,
      3 => 1666,
      4 => 1667,
      5 => 1668,
      6 => 1669,
      7 => 1670,
      8 => 1671,
      9 => 1672,
      10 => 1673,
    ),
  ),
  223 => 
  array (
    'name' => '童装童鞋',
    'pid' => '221',
    'cids' => 
    array (
      0 => 1650,
      1 => 1651,
      2 => 1652,
      3 => 1653,
      4 => 1654,
      5 => 1655,
      6 => 1656,
      7 => 1657,
      8 => 1658,
      9 => 1659,
      10 => 1660,
      11 => 1661,
      12 => 1662,
      13 => 1663,
    ),
  ),
  1229 => 
  array (
    'name' => '大家电',
    'pid' => '1224',
    'cids' => 
    array (
      0 => 1788,
      1 => 1789,
      2 => 1790,
      3 => 1791,
      4 => 1792,
      5 => 1793,
      6 => 1794,
      7 => 1795,
    ),
  ),
  1234 => 
  array (
    'name' => '手机通讯',
    'pid' => '1233',
    'cids' => 
    array (
      0 => 1826,
      1 => 1827,
      2 => 1828,
      3 => 1829,
      4 => 1830,
      5 => 1831,
      6 => 1832,
      7 => 1833,
      8 => 1834,
    ),
  ),
  1240 => 
  array (
    'name' => '文具',
    'pid' => '1239',
    'cids' => 
    array (
      0 => 1924,
      1 => 1922,
      2 => 1923,
      3 => 1925,
      4 => 1926,
      5 => 1927,
      6 => 1928,
      7 => 1929,
      8 => 1930,
    ),
  ),
  1243 => 
  array (
    'name' => '书籍报刊',
    'pid' => '2090',
    'cids' => 
    array (
      0 => 1891,
      1 => 1892,
      2 => 1893,
      3 => 1894,
      4 => 1895,
      5 => 1896,
      6 => 1897,
      7 => 1898,
      8 => 1899,
      9 => 1900,
      10 => 1901,
      11 => 1902,
      12 => 1903,
      13 => 1904,
      14 => 1905,
      15 => 1906,
    ),
  ),
  1250 => 
  array (
    'name' => '运动鞋',
    'pid' => '1249',
    'cids' => 
    array (
      0 => 1981,
      1 => 1982,
      2 => 1983,
      3 => 1984,
      4 => 1985,
      5 => 1986,
      6 => 1987,
      7 => 1988,
      8 => 1989,
    ),
  ),
  1256 => 
  array (
    'name' => '电子电器',
    'pid' => '1254',
    'cids' => 
    array (
      0 => 2033,
      1 => 2039,
      2 => 2040,
      3 => 2041,
      4 => 2042,
      5 => 2043,
      6 => 2044,
      7 => 2054,
      8 => 2055,
    ),
  ),
  1260 => 
  array (
    'name' => '出行旅游',
    'pid' => '1259',
    'cids' => 
    array (
      0 => 2056,
      1 => 2057,
      2 => 2058,
      3 => 2059,
      4 => 2060,
      5 => 2069,
      6 => 2091,
    ),
  ),
  1261 => 
  array (
    'name' => '电子凭证',
    'pid' => '1263',
    'cids' => 
    array (
      0 => 2070,
      1 => 2071,
      2 => 2072,
      3 => 2073,
      4 => 2074,
      5 => 2075,
      6 => 2076,
    ),
  ),
  1265 => 
  array (
    'name' => '太阳镜',
    'pid' => '2087',
    'cids' => 
    array (
    ),
  ),
  1270 => 
  array (
    'name' => '特色市场',
    'pid' => '0',
    'cids' => 
    array (
      0 => 1273,
      1 => 1271,
      2 => 1274,
      3 => 1272,
    ),
  ),
  1273 => 
  array (
    'name' => '10元特价',
    'pid' => '1270',
    'cids' => 
    array (
    ),
  ),
  1280 => 
  array (
    'name' => '裙装',
    'pid' => '4',
    'cids' => 
    array (
      0 => 1286,
    ),
  ),
  1283 => 
  array (
    'name' => '开衫外套',
    'pid' => '2',
    'cids' => 
    array (
    ),
  ),
  1286 => 
  array (
    'name' => '连衣裙',
    'pid' => '1280',
    'cids' => 
    array (
    ),
  ),
  1295 => 
  array (
    'name' => '牛仔裤',
    'pid' => '36',
    'cids' => 
    array (
    ),
  ),
  1299 => 
  array (
    'name' => '商务男鞋',
    'pid' => '38',
    'cids' => 
    array (
    ),
  ),
  1303 => 
  array (
    'name' => '风衣',
    'pid' => '1302',
    'cids' => 
    array (
    ),
  ),
  1307 => 
  array (
    'name' => '单鞋',
    'pid' => '92',
    'cids' => 
    array (
    ),
  ),
  1314 => 
  array (
    'name' => '手拎袋',
    'pid' => '99',
    'cids' => 
    array (
    ),
  ),
  1320 => 
  array (
    'name' => '项链',
    'pid' => '118',
    'cids' => 
    array (
    ),
  ),
  1333 => 
  array (
    'name' => '遮阳帽',
    'pid' => '100',
    'cids' => 
    array (
    ),
  ),
  1337 => 
  array (
    'name' => '领带',
    'pid' => '37',
    'cids' => 
    array (
    ),
  ),
  1346 => 
  array (
    'name' => '旅行包',
    'pid' => '1345',
    'cids' => 
    array (
    ),
  ),
  1352 => 
  array (
    'name' => '结婚钻戒',
    'pid' => '186',
    'cids' => 
    array (
    ),
  ),
  1360 => 
  array (
    'name' => '男表',
    'pid' => '188',
    'cids' => 
    array (
      0 => 1368,
      1 => 1369,
      2 => 1370,
    ),
  ),
  1368 => 
  array (
    'name' => '石英表',
    'pid' => '1360',
    'cids' => 
    array (
    ),
  ),
  1373 => 
  array (
    'name' => '精油芳疗',
    'pid' => '138',
    'cids' => 
    array (
      0 => 1375,
      1 => 1376,
      2 => 1377,
    ),
  ),
  1375 => 
  array (
    'name' => '纯露/花水',
    'pid' => '1373',
    'cids' => 
    array (
    ),
  ),
  1378 => 
  array (
    'name' => '女士香水',
    'pid' => '1374',
    'cids' => 
    array (
    ),
  ),
  1381 => 
  array (
    'name' => '面部护肤',
    'pid' => '135',
    'cids' => 
    array (
      0 => 1555,
      1 => 1556,
      2 => 1557,
      3 => 1558,
      4 => 1559,
      5 => 1560,
      6 => 1561,
      7 => 1562,
      8 => 1566,
      9 => 1563,
      10 => 1564,
      11 => 1565,
    ),
  ),
  1384 => 
  array (
    'name' => '风尚彩妆',
    'pid' => '137',
    'cids' => 
    array (
      0 => 1386,
      1 => 1387,
      2 => 1388,
      3 => 1389,
      4 => 1390,
      5 => 1391,
      6 => 1392,
      7 => 1393,
      8 => 1394,
      9 => 1395,
      10 => 1396,
      11 => 1397,
    ),
  ),
  1386 => 
  array (
    'name' => 'BB霜',
    'pid' => '1384',
    'cids' => 
    array (
    ),
  ),
  1398 => 
  array (
    'name' => '时尚假发',
    'pid' => '1385',
    'cids' => 
    array (
    ),
  ),
  1404 => 
  array (
    'name' => '纤体瘦身',
    'pid' => '136',
    'cids' => 
    array (
    ),
  ),
  1412 => 
  array (
    'name' => '文胸',
    'pid' => '58',
    'cids' => 
    array (
    ),
  ),
  1416 => 
  array (
    'name' => '睡衣',
    'pid' => '59',
    'cids' => 
    array (
    ),
  ),
  1422 => 
  array (
    'name' => '男士内裤',
    'pid' => '61',
    'cids' => 
    array (
    ),
  ),
  1424 => 
  array (
    'name' => '剃须刀',
    'pid' => '175',
    'cids' => 
    array (
    ),
  ),
  1447 => 
  array (
    'name' => '床上用品',
    'pid' => '172',
    'cids' => 
    array (
      0 => 1448,
      1 => 1449,
      2 => 1450,
      3 => 1451,
      4 => 1452,
      5 => 1453,
      6 => 1454,
      7 => 1455,
      8 => 1456,
      9 => 1457,
      10 => 1458,
      11 => 1459,
      12 => 1460,
      13 => 1461,
      14 => 1462,
    ),
  ),
  1448 => 
  array (
    'name' => '四件套',
    'pid' => '1447',
    'cids' => 
    array (
    ),
  ),
  1463 => 
  array (
    'name' => '猫主食',
    'pid' => '176',
    'cids' => 
    array (
    ),
  ),
  1474 => 
  array (
    'name' => '厨房锅具',
    'pid' => '173',
    'cids' => 
    array (
      0 => 1525,
      1 => 1526,
      2 => 1527,
      3 => 1528,
      4 => 1529,
      5 => 1530,
      6 => 1531,
      7 => 1532,
      8 => 1533,
      9 => 1534,
      10 => 1535,
      11 => 1536,
      12 => 1537,
      13 => 1538,
      14 => 1539,
    ),
  ),
  1479 => 
  array (
    'name' => '压缩袋',
    'pid' => '1478',
    'cids' => 
    array (
    ),
  ),
  1495 => 
  array (
    'name' => '洗发',
    'pid' => '1494',
    'cids' => 
    array (
    ),
  ),
  1509 => 
  array (
    'name' => '家庭清洁',
    'pid' => '174',
    'cids' => 
    array (
      0 => 1510,
      1 => 1511,
      2 => 1512,
      3 => 1513,
      4 => 1514,
      5 => 1523,
      6 => 1515,
      7 => 1516,
      8 => 1524,
      9 => 1517,
      10 => 1518,
      11 => 1519,
      12 => 1520,
      13 => 1521,
      14 => 1522,
    ),
  ),
  1510 => 
  array (
    'name' => '洗衣',
    'pid' => '1509',
    'cids' => 
    array (
    ),
  ),
  1525 => 
  array (
    'name' => '炒锅',
    'pid' => '1474',
    'cids' => 
    array (
    ),
  ),
  1541 => 
  array (
    'name' => '瓷器餐具',
    'pid' => '1475',
    'cids' => 
    array (
    ),
  ),
  1555 => 
  array (
    'name' => '洁面',
    'pid' => '1381',
    'cids' => 
    array (
    ),
  ),
  1567 => 
  array (
    'name' => '试用服务',
    'pid' => '1382',
    'cids' => 
    array (
    ),
  ),
  1572 => 
  array (
    'name' => '护肤套装',
    'pid' => '1383',
    'cids' => 
    array (
    ),
  ),
  1580 => 
  array (
    'name' => '奶粉',
    'pid' => '163',
    'cids' => 
    array (
    ),
  ),
  1591 => 
  array (
    'name' => '奶瓶',
    'pid' => '164',
    'cids' => 
    array (
    ),
  ),
  1604 => 
  array (
    'name' => '早教机',
    'pid' => '165',
    'cids' => 
    array (
    ),
  ),
  1616 => 
  array (
    'name' => '防辐射服',
    'pid' => '166',
    'cids' => 
    array (
    ),
  ),
  1632 => 
  array (
    'name' => '学步车',
    'pid' => '1628',
    'cids' => 
    array (
    ),
  ),
  1643 => 
  array (
    'name' => '儿童玩具',
    'pid' => '225',
    'cids' => 
    array (
    ),
  ),
  1650 => 
  array (
    'name' => '短袖T恤',
    'pid' => '223',
    'cids' => 
    array (
    ),
  ),
  1674 => 
  array (
    'name' => '粗粮',
    'pid' => '209',
    'cids' => 
    array (
    ),
  ),
  1693 => 
  array (
    'name' => '肉干肉脯',
    'pid' => '207',
    'cids' => 
    array (
      0 => 1728,
      1 => 1729,
      2 => 1730,
      3 => 1731,
      4 => 1732,
      5 => 1733,
      6 => 1734,
      7 => 1735,
      8 => 1736,
      9 => 1737,
      10 => 1738,
    ),
  ),
  1697 => 
  array (
    'name' => '茶叶冲饮',
    'pid' => '208',
    'cids' => 
    array (
      0 => 1698,
      1 => 1699,
      2 => 1700,
      3 => 1701,
      4 => 1702,
      5 => 1703,
      6 => 1704,
      7 => 1705,
      8 => 1706,
      9 => 1707,
      10 => 1708,
      11 => 1709,
      12 => 1710,
      13 => 1711,
      14 => 1712,
    ),
  ),
  1698 => 
  array (
    'name' => '绿茶',
    'pid' => '1697',
    'cids' => 
    array (
    ),
  ),
  1713 => 
  array (
    'name' => '传统滋补',
    'pid' => '210',
    'cids' => 
    array (
      0 => 1714,
      1 => 1715,
      2 => 1716,
      3 => 1717,
      4 => 1718,
      5 => 1719,
      6 => 1720,
      7 => 1721,
      8 => 1722,
      9 => 1723,
      10 => 1724,
      11 => 1725,
      12 => 1726,
      13 => 1727,
    ),
  ),
  1714 => 
  array (
    'name' => '红枣',
    'pid' => '1713',
    'cids' => 
    array (
    ),
  ),
  1728 => 
  array (
    'name' => '牛肉类',
    'pid' => '1693',
    'cids' => 
    array (
    ),
  ),
  1739 => 
  array (
    'name' => '山核桃',
    'pid' => '1694',
    'cids' => 
    array (
    ),
  ),
  1753 => 
  array (
    'name' => '巧克力',
    'pid' => '1695',
    'cids' => 
    array (
    ),
  ),
  1766 => 
  array (
    'name' => '饼干',
    'pid' => '1696',
    'cids' => 
    array (
    ),
  ),
  1779 => 
  array (
    'name' => '石英表',
    'pid' => '1361',
    'cids' => 
    array (
    ),
  ),
  1782 => 
  array (
    'name' => '石英表',
    'pid' => '1777',
    'cids' => 
    array (
    ),
  ),
  1785 => 
  array (
    'name' => '石英表',
    'pid' => '1778',
    'cids' => 
    array (
    ),
  ),
  1788 => 
  array (
    'name' => '液晶电视',
    'pid' => '1229',
    'cids' => 
    array (
    ),
  ),
  1804 => 
  array (
    'name' => '豆浆机',
    'pid' => '1231',
    'cids' => 
    array (
    ),
  ),
  1812 => 
  array (
    'name' => '耳机',
    'pid' => '1232',
    'cids' => 
    array (
    ),
  ),
  1826 => 
  array (
    'name' => '智能机',
    'pid' => '1234',
    'cids' => 
    array (
    ),
  ),
  1835 => 
  array (
    'name' => '游戏本',
    'pid' => '1235',
    'cids' => 
    array (
    ),
  ),
  1841 => 
  array (
    'name' => '台式电脑',
    'pid' => '1238',
    'cids' => 
    array (
    ),
  ),
  1853 => 
  array (
    'name' => '打印机',
    'pid' => '1823',
    'cids' => 
    array (
    ),
  ),
  1860 => 
  array (
    'name' => 'iPad平板',
    'pid' => '1822',
    'cids' => 
    array (
    ),
  ),
  1866 => 
  array (
    'name' => '电子辞典/学习机',
    'pid' => '1824',
    'cids' => 
    array (
    ),
  ),
  1880 => 
  array (
    'name' => 'MP3',
    'pid' => '1821',
    'cids' => 
    array (
    ),
  ),
  1885 => 
  array (
    'name' => '普通数码',
    'pid' => '1236',
    'cids' => 
    array (
    ),
  ),
  1890 => 
  array (
    'name' => '户外鞋服',
    'pid' => '1253',
    'cids' => 
    array (
      0 => 1962,
      1 => 1963,
      2 => 1964,
      3 => 1965,
      4 => 1966,
      5 => 1967,
      6 => 1968,
      7 => 1969,
      8 => 1970,
      9 => 1971,
    ),
  ),
  1891 => 
  array (
    'name' => '文学',
    'pid' => '1243',
    'cids' => 
    array (
    ),
  ),
  1907 => 
  array (
    'name' => '紫砂艺术',
    'pid' => '1242',
    'cids' => 
    array (
    ),
  ),
  1912 => 
  array (
    'name' => '音乐CD/VCD',
    'pid' => '1241',
    'cids' => 
    array (
    ),
  ),
  1924 => 
  array (
    'name' => '笔袋/文具盒',
    'pid' => '1240',
    'cids' => 
    array (
    ),
  ),
  1931 => 
  array (
    'name' => '室内健身',
    'pid' => '1252',
    'cids' => 
    array (
      0 => 1932,
      1 => 1933,
      2 => 1934,
      3 => 1935,
      4 => 1936,
      5 => 1937,
      6 => 1938,
    ),
  ),
  1932 => 
  array (
    'name' => '泳装',
    'pid' => '1931',
    'cids' => 
    array (
    ),
  ),
  1948 => 
  array (
    'name' => '自行车',
    'pid' => '1947',
    'cids' => 
    array (
    ),
  ),
  1956 => 
  array (
    'name' => '羽毛球',
    'pid' => '1955',
    'cids' => 
    array (
    ),
  ),
  1962 => 
  array (
    'name' => '春夏冲锋衣',
    'pid' => '1890',
    'cids' => 
    array (
    ),
  ),
  1972 => 
  array (
    'name' => '运动风衣',
    'pid' => '1251',
    'cids' => 
    array (
    ),
  ),
  1981 => 
  array (
    'name' => '板鞋',
    'pid' => '1250',
    'cids' => 
    array (
    ),
  ),
  1990 => 
  array (
    'name' => '常规养护',
    'pid' => '1258',
    'cids' => 
    array (
      0 => 1991,
      1 => 1992,
      2 => 1993,
      3 => 1994,
      4 => 1995,
      5 => 1996,
    ),
  ),
  1991 => 
  array (
    'name' => '润滑油',
    'pid' => '1990',
    'cids' => 
    array (
    ),
  ),
  1998 => 
  array (
    'name' => '洗车机',
    'pid' => '1997',
    'cids' => 
    array (
    ),
  ),
  2005 => 
  array (
    'name' => '外饰配件',
    'pid' => '1257',
    'cids' => 
    array (
      0 => 2006,
      1 => 2007,
      2 => 2008,
      3 => 2009,
      4 => 2010,
      5 => 2011,
      6 => 2012,
    ),
  ),
  2006 => 
  array (
    'name' => '防爆膜',
    'pid' => '2005',
    'cids' => 
    array (
    ),
  ),
  2014 => 
  array (
    'name' => '坐垫/座套',
    'pid' => '2013',
    'cids' => 
    array (
    ),
  ),
  2025 => 
  array (
    'name' => 'DVD导航',
    'pid' => '2024',
    'cids' => 
    array (
    ),
  ),
  2031 => 
  array (
    'name' => '车载影音',
    'pid' => '1255',
    'cids' => 
    array (
      0 => 2032,
      1 => 2034,
      2 => 2035,
      3 => 2036,
      4 => 2037,
      5 => 2038,
    ),
  ),
  2032 => 
  array (
    'name' => 'mp3',
    'pid' => '2031',
    'cids' => 
    array (
    ),
  ),
  2033 => 
  array (
    'name' => '吸尘器',
    'pid' => '1256',
    'cids' => 
    array (
    ),
  ),
  2049 => 
  array (
    'name' => '氙气灯',
    'pid' => '2048',
    'cids' => 
    array (
    ),
  ),
  2056 => 
  array (
    'name' => '景点门票',
    'pid' => '1260',
    'cids' => 
    array (
    ),
  ),
  2061 => 
  array (
    'name' => '演出活动',
    'pid' => '1263',
    'cids' => 
    array (
    ),
  ),
  2070 => 
  array (
    'name' => '中式餐',
    'pid' => '1261',
    'cids' => 
    array (
    ),
  ),
  2077 => 
  array (
    'name' => '个性定制',
    'pid' => '1262',
    'cids' => 
    array (
    ),
  ),
  2085 => 
  array (
    'name' => '衬衫T恤',
    'pid' => '35',
    'cids' => 
    array (
    ),
  ),
  2087 => 
  array (
    'name' => '眼镜专区',
    'pid' => '189',
    'cids' => 
    array (
      0 => 1265,
      1 => 1264,
      2 => 1372,
      3 => 1371,
      4 => 2161,
    ),
  ),
  2093 => 
  array (
    'name' => '吉他',
    'pid' => '2092',
    'cids' => 
    array (
    ),
  ),
  2104 => 
  array (
    'name' => '基础建材',
    'pid' => '1477',
    'cids' => 
    array (
      0 => 2106,
      1 => 2107,
      2 => 2108,
      3 => 2109,
      4 => 2110,
      5 => 2111,
      6 => 2112,
    ),
  ),
  2106 => 
  array (
    'name' => '水管管材',
    'pid' => '2104',
    'cids' => 
    array (
    ),
  ),
  2123 => 
  array (
    'name' => '开关',
    'pid' => '2102',
    'cids' => 
    array (
    ),
  ),
  2131 => 
  array (
    'name' => '家用五金',
    'pid' => '2103',
    'cids' => 
    array (
    ),
  ),
  2138 => 
  array (
    'name' => '家饰',
    'pid' => '2105',
    'cids' => 
    array (
      0 => 2139,
      1 => 2140,
      2 => 2141,
      3 => 2142,
      4 => 2143,
      5 => 2144,
      6 => 2145,
      7 => 2146,
      8 => 2147,
      9 => 2148,
      10 => 2149,
    ),
  ),
  2139 => 
  array (
    'name' => '地毯',
    'pid' => '2138',
    'cids' => 
    array (
    ),
  ),
  2153 => 
  array (
    'name' => '女用器具',
    'pid' => '2156',
    'cids' => 
    array (
    ),
  ),
  2159 => 
  array (
    'name' => 'OTC药品',
    'pid' => '2150',
    'cids' => 
    array (
    ),
  ),
  1 => 
  array (
    'name' => '潮女服饰',
    'pid' => '0',
    'cids' => 
    array (
      0 => 2,
      1 => 4,
      2 => 7,
      3 => 6,
    ),
  ),
  4 => 
  array (
    'name' => '潮女下装',
    'pid' => '1',
    'cids' => 
    array (
      0 => 1280,
      1 => 1284,
    ),
  ),
  36 => 
  array (
    'name' => '型男下装',
    'pid' => '21',
    'cids' => 
    array (
      0 => 1295,
      1 => 1296,
      2 => 1297,
    ),
  ),
  61 => 
  array (
    'name' => '男士内衣',
    'pid' => '57',
    'cids' => 
    array (
      0 => 1422,
      1 => 1423,
    ),
  ),
  99 => 
  array (
    'name' => '潮流女包',
    'pid' => '73',
    'cids' => 
    array (
      0 => 1314,
      1 => 1315,
      2 => 1316,
      3 => 1317,
      4 => 1318,
      5 => 1319,
    ),
  ),
  136 => 
  array (
    'name' => '美体瘦身',
    'pid' => '134',
    'cids' => 
    array (
      0 => 1404,
      1 => 1405,
      2 => 1406,
      3 => 1407,
      4 => 1408,
      5 => 1409,
      6 => 1410,
      7 => 1411,
    ),
  ),
  166 => 
  array (
    'name' => '孕妈专区',
    'pid' => '162',
    'cids' => 
    array (
      0 => 1616,
      1 => 1617,
      2 => 1618,
      3 => 1619,
      4 => 1620,
      5 => 1621,
      6 => 1622,
      7 => 1623,
      8 => 1624,
      9 => 1625,
      10 => 1626,
      11 => 1627,
    ),
  ),
  186 => 
  array (
    'name' => '钻石珠宝',
    'pid' => '185',
    'cids' => 
    array (
      0 => 1352,
      1 => 1359,
      2 => 1353,
      3 => 1354,
      4 => 1355,
      5 => 1356,
      6 => 1357,
      7 => 1358,
    ),
  ),
  207 => 
  array (
    'name' => '零食特产',
    'pid' => '206',
    'cids' => 
    array (
      0 => 1693,
      1 => 1694,
      2 => 1695,
      3 => 1696,
    ),
  ),
  225 => 
  array (
    'name' => '模型玩具',
    'pid' => '221',
    'cids' => 
    array (
      0 => 1643,
      1 => 1644,
      2 => 1645,
      3 => 1646,
      4 => 1647,
      5 => 1648,
      6 => 1649,
    ),
  ),
  1230 => 
  array (
    'name' => '生活电器',
    'pid' => '1224',
    'cids' => 
    array (
      0 => 175,
      1 => 1796,
      2 => 1797,
      3 => 1798,
      4 => 1799,
      5 => 1800,
      6 => 1801,
      7 => 1802,
      8 => 1803,
    ),
  ),
  1235 => 
  array (
    'name' => '笔记本',
    'pid' => '1238',
    'cids' => 
    array (
      0 => 1835,
      1 => 1836,
      2 => 1837,
      3 => 1838,
      4 => 1839,
      5 => 1840,
    ),
  ),
  1241 => 
  array (
    'name' => '音乐电影',
    'pid' => '2090',
    'cids' => 
    array (
      0 => 1912,
      1 => 1913,
      2 => 1914,
      3 => 1915,
      4 => 1916,
      5 => 1917,
      6 => 1918,
      7 => 1919,
      8 => 1920,
      9 => 1921,
    ),
  ),
  1251 => 
  array (
    'name' => '运动服',
    'pid' => '1249',
    'cids' => 
    array (
      0 => 1972,
      1 => 1973,
      2 => 1974,
      3 => 1975,
      4 => 1976,
      5 => 1977,
      6 => 1978,
      7 => 1979,
      8 => 1980,
    ),
  ),
  1255 => 
  array (
    'name' => '影音导航',
    'pid' => '1254',
    'cids' => 
    array (
      0 => 2031,
      1 => 2024,
    ),
  ),
  1263 => 
  array (
    'name' => '折扣卡券',
    'pid' => '1259',
    'cids' => 
    array (
      0 => 1261,
      1 => 2061,
      2 => 2062,
      3 => 2063,
      4 => 2064,
      5 => 2065,
      6 => 2066,
      7 => 2067,
      8 => 2068,
    ),
  ),
  1264 => 
  array (
    'name' => '眼镜架',
    'pid' => '2087',
    'cids' => 
    array (
    ),
  ),
  1266 => 
  array (
    'name' => 'Zippo/烟具',
    'pid' => '189',
    'cids' => 
    array (
    ),
  ),
  1271 => 
  array (
    'name' => '3折封顶',
    'pid' => '1270',
    'cids' => 
    array (
    ),
  ),
  1279 => 
  array (
    'name' => '衬衫卫衣',
    'pid' => '2',
    'cids' => 
    array (
    ),
  ),
  1284 => 
  array (
    'name' => '时尚女裤',
    'pid' => '4',
    'cids' => 
    array (
    ),
  ),
  1294 => 
  array (
    'name' => '卫衣',
    'pid' => '35',
    'cids' => 
    array (
    ),
  ),
  1296 => 
  array (
    'name' => '休闲裤',
    'pid' => '36',
    'cids' => 
    array (
    ),
  ),
  1300 => 
  array (
    'name' => '休闲男鞋',
    'pid' => '38',
    'cids' => 
    array (
    ),
  ),
  1304 => 
  array (
    'name' => '棉衣',
    'pid' => '1302',
    'cids' => 
    array (
    ),
  ),
  1308 => 
  array (
    'name' => '凉鞋',
    'pid' => '92',
    'cids' => 
    array (
    ),
  ),
  1315 => 
  array (
    'name' => '单肩包',
    'pid' => '99',
    'cids' => 
    array (
    ),
  ),
  1321 => 
  array (
    'name' => '耳环',
    'pid' => '118',
    'cids' => 
    array (
    ),
  ),
  1334 => 
  array (
    'name' => '丝巾',
    'pid' => '100',
    'cids' => 
    array (
    ),
  ),
  1338 => 
  array (
    'name' => '男士皮带',
    'pid' => '37',
    'cids' => 
    array (
    ),
  ),
  1347 => 
  array (
    'name' => '拉杆箱',
    'pid' => '1345',
    'cids' => 
    array (
    ),
  ),
  1359 => 
  array (
    'name' => '钻石',
    'pid' => '186',
    'cids' => 
    array (
    ),
  ),
  1361 => 
  array (
    'name' => '女表',
    'pid' => '188',
    'cids' => 
    array (
      0 => 1779,
      1 => 1780,
      2 => 1781,
    ),
  ),
  1369 => 
  array (
    'name' => '机械表',
    'pid' => '1360',
    'cids' => 
    array (
    ),
  ),
  1374 => 
  array (
    'name' => '经典香氛',
    'pid' => '138',
    'cids' => 
    array (
      0 => 1378,
      1 => 1379,
      2 => 1380,
    ),
  ),
  1376 => 
  array (
    'name' => '单方精油',
    'pid' => '1373',
    'cids' => 
    array (
    ),
  ),
  1379 => 
  array (
    'name' => '男士香水',
    'pid' => '1374',
    'cids' => 
    array (
    ),
  ),
  1382 => 
  array (
    'name' => '敏感修护',
    'pid' => '135',
    'cids' => 
    array (
      0 => 1567,
      1 => 1568,
      2 => 1569,
      3 => 1570,
      4 => 1571,
    ),
  ),
  1385 => 
  array (
    'name' => '美妆工具',
    'pid' => '137',
    'cids' => 
    array (
      0 => 1398,
      1 => 1399,
      2 => 1400,
      3 => 1401,
      4 => 1402,
      5 => 1403,
    ),
  ),
  1387 => 
  array (
    'name' => '隔离打底',
    'pid' => '1384',
    'cids' => 
    array (
    ),
  ),
  1399 => 
  array (
    'name' => '假睫毛',
    'pid' => '1385',
    'cids' => 
    array (
    ),
  ),
  1405 => 
  array (
    'name' => '美胸',
    'pid' => '136',
    'cids' => 
    array (
    ),
  ),
  1413 => 
  array (
    'name' => '文胸套装',
    'pid' => '58',
    'cids' => 
    array (
    ),
  ),
  1417 => 
  array (
    'name' => '睡衣套装',
    'pid' => '59',
    'cids' => 
    array (
    ),
  ),
  1423 => 
  array (
    'name' => '男士背心',
    'pid' => '61',
    'cids' => 
    array (
    ),
  ),
  1425 => 
  array (
    'name' => '电吹风',
    'pid' => '175',
    'cids' => 
    array (
    ),
  ),
  1449 => 
  array (
    'name' => '被子',
    'pid' => '1447',
    'cids' => 
    array (
    ),
  ),
  1464 => 
  array (
    'name' => '猫零食',
    'pid' => '176',
    'cids' => 
    array (
    ),
  ),
  1475 => 
  array (
    'name' => '餐饮用品',
    'pid' => '173',
    'cids' => 
    array (
      0 => 1541,
      1 => 1542,
      2 => 1543,
      3 => 1544,
      4 => 1545,
      5 => 1546,
      6 => 1547,
      7 => 1548,
      8 => 1549,
      9 => 1550,
      10 => 1551,
      11 => 1552,
      12 => 1553,
      13 => 1554,
    ),
  ),
  1478 => 
  array (
    'name' => '收纳整理',
    'pid' => '174',
    'cids' => 
    array (
      0 => 1479,
      1 => 1480,
      2 => 1481,
      3 => 1482,
      4 => 1483,
      5 => 1484,
      6 => 1485,
      7 => 1486,
      8 => 1487,
      9 => 1488,
      10 => 1489,
      11 => 1490,
      12 => 1491,
      13 => 1492,
      14 => 1493,
    ),
  ),
  1480 => 
  array (
    'name' => '被子收纳',
    'pid' => '1478',
    'cids' => 
    array (
    ),
  ),
  1494 => 
  array (
    'name' => '个人洗护',
    'pid' => '172',
    'cids' => 
    array (
      0 => 1495,
      1 => 1496,
      2 => 1497,
      3 => 1498,
      4 => 1499,
      5 => 1500,
      6 => 1501,
      7 => 1502,
      8 => 1503,
      9 => 1504,
      10 => 1505,
      11 => 1506,
      12 => 1507,
      13 => 1508,
    ),
  ),
  1496 => 
  array (
    'name' => '牙膏',
    'pid' => '1494',
    'cids' => 
    array (
    ),
  ),
  1511 => 
  array (
    'name' => '衣架',
    'pid' => '1509',
    'cids' => 
    array (
    ),
  ),
  1526 => 
  array (
    'name' => '煎锅',
    'pid' => '1474',
    'cids' => 
    array (
    ),
  ),
  1542 => 
  array (
    'name' => '碗',
    'pid' => '1475',
    'cids' => 
    array (
    ),
  ),
  1556 => 
  array (
    'name' => '爽肤水',
    'pid' => '1381',
    'cids' => 
    array (
    ),
  ),
  1568 => 
  array (
    'name' => '去红血丝',
    'pid' => '1382',
    'cids' => 
    array (
    ),
  ),
  1573 => 
  array (
    'name' => '洁面',
    'pid' => '1383',
    'cids' => 
    array (
    ),
  ),
  1581 => 
  array (
    'name' => '米粉',
    'pid' => '163',
    'cids' => 
    array (
    ),
  ),
  1592 => 
  array (
    'name' => '奶嘴',
    'pid' => '164',
    'cids' => 
    array (
    ),
  ),
  1605 => 
  array (
    'name' => '识字卡',
    'pid' => '165',
    'cids' => 
    array (
    ),
  ),
  1617 => 
  array (
    'name' => '孕妇装',
    'pid' => '166',
    'cids' => 
    array (
    ),
  ),
  1631 => 
  array (
    'name' => '三轮车',
    'pid' => '1628',
    'cids' => 
    array (
    ),
  ),
  1644 => 
  array (
    'name' => '娃娃玩偶',
    'pid' => '225',
    'cids' => 
    array (
    ),
  ),
  1651 => 
  array (
    'name' => '长袖T恤',
    'pid' => '223',
    'cids' => 
    array (
    ),
  ),
  1664 => 
  array (
    'name' => '国产白酒',
    'pid' => '208',
    'cids' => 
    array (
    ),
  ),
  1675 => 
  array (
    'name' => '薏仁',
    'pid' => '209',
    'cids' => 
    array (
    ),
  ),
  1686 => 
  array (
    'name' => '胶原蛋白',
    'pid' => '210',
    'cids' => 
    array (
    ),
  ),
  1694 => 
  array (
    'name' => '坚果炒货',
    'pid' => '207',
    'cids' => 
    array (
      0 => 1739,
      1 => 1740,
      2 => 1741,
      3 => 1742,
      4 => 1743,
      5 => 1744,
      6 => 1745,
      7 => 1746,
      8 => 1747,
      9 => 1748,
      10 => 1749,
      11 => 1750,
      12 => 1751,
      13 => 1752,
    ),
  ),
  1699 => 
  array (
    'name' => '红茶',
    'pid' => '1697',
    'cids' => 
    array (
    ),
  ),
  1715 => 
  array (
    'name' => '枸杞',
    'pid' => '1713',
    'cids' => 
    array (
    ),
  ),
  1729 => 
  array (
    'name' => '猪肉类',
    'pid' => '1693',
    'cids' => 
    array (
    ),
  ),
  1740 => 
  array (
    'name' => '碧根果',
    'pid' => '1694',
    'cids' => 
    array (
    ),
  ),
  1754 => 
  array (
    'name' => '喜糖',
    'pid' => '1695',
    'cids' => 
    array (
    ),
  ),
  1767 => 
  array (
    'name' => '松塔',
    'pid' => '1696',
    'cids' => 
    array (
    ),
  ),
  1780 => 
  array (
    'name' => '机械表',
    'pid' => '1361',
    'cids' => 
    array (
    ),
  ),
  1783 => 
  array (
    'name' => '机械表',
    'pid' => '1777',
    'cids' => 
    array (
    ),
  ),
  1786 => 
  array (
    'name' => '机械表',
    'pid' => '1778',
    'cids' => 
    array (
    ),
  ),
  1789 => 
  array (
    'name' => '3D电视',
    'pid' => '1229',
    'cids' => 
    array (
    ),
  ),
  1796 => 
  array (
    'name' => '取暖器',
    'pid' => '1230',
    'cids' => 
    array (
    ),
  ),
  1805 => 
  array (
    'name' => '电饭煲',
    'pid' => '1231',
    'cids' => 
    array (
    ),
  ),
  1813 => 
  array (
    'name' => '家庭影院',
    'pid' => '1232',
    'cids' => 
    array (
    ),
  ),
  1823 => 
  array (
    'name' => '办公设备',
    'pid' => '1239',
    'cids' => 
    array (
      0 => 1853,
      1 => 1854,
      2 => 1855,
      3 => 1856,
      4 => 1857,
      5 => 1858,
      6 => 1859,
    ),
  ),
  1827 => 
  array (
    'name' => '非智能机',
    'pid' => '1234',
    'cids' => 
    array (
    ),
  ),
  1836 => 
  array (
    'name' => '高性价比',
    'pid' => '1235',
    'cids' => 
    array (
    ),
  ),
  1854 => 
  array (
    'name' => '多功能一体机',
    'pid' => '1823',
    'cids' => 
    array (
    ),
  ),
  1861 => 
  array (
    'name' => 'Android平板',
    'pid' => '1822',
    'cids' => 
    array (
    ),
  ),
  1867 => 
  array (
    'name' => '点读机',
    'pid' => '1824',
    'cids' => 
    array (
    ),
  ),
  1873 => 
  array (
    'name' => '电子相框',
    'pid' => '1825',
    'cids' => 
    array (
    ),
  ),
  1881 => 
  array (
    'name' => 'MP4',
    'pid' => '1821',
    'cids' => 
    array (
    ),
  ),
  1886 => 
  array (
    'name' => '单反相机',
    'pid' => '1236',
    'cids' => 
    array (
    ),
  ),
  1892 => 
  array (
    'name' => '小说',
    'pid' => '1243',
    'cids' => 
    array (
    ),
  ),
  1908 => 
  array (
    'name' => '金石篆刻',
    'pid' => '1242',
    'cids' => 
    array (
    ),
  ),
  1913 => 
  array (
    'name' => '电视剧',
    'pid' => '1241',
    'cids' => 
    array (
    ),
  ),
  1922 => 
  array (
    'name' => '笔记本',
    'pid' => '1240',
    'cids' => 
    array (
    ),
  ),
  1933 => 
  array (
    'name' => '跑步机',
    'pid' => '1931',
    'cids' => 
    array (
    ),
  ),
  1939 => 
  array (
    'name' => '望远镜',
    'pid' => '1253',
    'cids' => 
    array (
    ),
  ),
  1947 => 
  array (
    'name' => '休闲运动',
    'pid' => '1252',
    'cids' => 
    array (
      0 => 1948,
      1 => 1949,
      2 => 1950,
      3 => 1951,
      4 => 1952,
      5 => 1953,
      6 => 1954,
    ),
  ),
  1949 => 
  array (
    'name' => '轮滑',
    'pid' => '1947',
    'cids' => 
    array (
    ),
  ),
  1957 => 
  array (
    'name' => '网球',
    'pid' => '1955',
    'cids' => 
    array (
    ),
  ),
  1963 => 
  array (
    'name' => '抓绒衣',
    'pid' => '1890',
    'cids' => 
    array (
    ),
  ),
  1973 => 
  array (
    'name' => '卫衣',
    'pid' => '1251',
    'cids' => 
    array (
    ),
  ),
  1982 => 
  array (
    'name' => '跑步鞋',
    'pid' => '1250',
    'cids' => 
    array (
    ),
  ),
  1992 => 
  array (
    'name' => '齿轮油',
    'pid' => '1990',
    'cids' => 
    array (
    ),
  ),
  1997 => 
  array (
    'name' => '清洗美容',
    'pid' => '1258',
    'cids' => 
    array (
      0 => 1998,
      1 => 1999,
      2 => 2000,
      3 => 2001,
      4 => 2002,
      5 => 2003,
      6 => 2004,
      7 => 2046,
    ),
  ),
  1999 => 
  array (
    'name' => '洗车水枪',
    'pid' => '1997',
    'cids' => 
    array (
    ),
  ),
  2007 => 
  array (
    'name' => '车牌架',
    'pid' => '2005',
    'cids' => 
    array (
    ),
  ),
  2013 => 
  array (
    'name' => '车内用品',
    'pid' => '1257',
    'cids' => 
    array (
      0 => 2014,
      1 => 2017,
      2 => 2015,
      3 => 2016,
      4 => 2018,
      5 => 2019,
      6 => 2020,
      7 => 2021,
      8 => 2022,
      9 => 2023,
      10 => 2045,
    ),
  ),
  2017 => 
  array (
    'name' => '脚垫',
    'pid' => '2013',
    'cids' => 
    array (
    ),
  ),
  2024 => 
  array (
    'name' => 'GPS导航',
    'pid' => '1255',
    'cids' => 
    array (
      0 => 2025,
      1 => 2026,
      2 => 2027,
      3 => 2028,
      4 => 2029,
      5 => 2030,
    ),
  ),
  2026 => 
  array (
    'name' => '便携GPS',
    'pid' => '2024',
    'cids' => 
    array (
    ),
  ),
  2034 => 
  array (
    'name' => 'CD机',
    'pid' => '2031',
    'cids' => 
    array (
    ),
  ),
  2039 => 
  array (
    'name' => '逆变器',
    'pid' => '1256',
    'cids' => 
    array (
    ),
  ),
  2050 => 
  array (
    'name' => '火花塞',
    'pid' => '2048',
    'cids' => 
    array (
    ),
  ),
  2057 => 
  array (
    'name' => '旅游线路',
    'pid' => '1260',
    'cids' => 
    array (
    ),
  ),
  2062 => 
  array (
    'name' => '餐饮折扣',
    'pid' => '1263',
    'cids' => 
    array (
    ),
  ),
  2071 => 
  array (
    'name' => '冰淇淋',
    'pid' => '1261',
    'cids' => 
    array (
    ),
  ),
  2094 => 
  array (
    'name' => '古筝',
    'pid' => '2092',
    'cids' => 
    array (
    ),
  ),
  2105 => 
  array (
    'name' => '家装家饰',
    'pid' => '1477',
    'cids' => 
    array (
      0 => 2138,
      1 => 2113,
      2 => 2114,
      3 => 2115,
      4 => 2116,
      5 => 2117,
      6 => 2118,
      7 => 2119,
      8 => 2120,
      9 => 2121,
      10 => 2122,
    ),
  ),
  2107 => 
  array (
    'name' => '板材',
    'pid' => '2104',
    'cids' => 
    array (
    ),
  ),
  2113 => 
  array (
    'name' => '工艺灯饰',
    'pid' => '2105',
    'cids' => 
    array (
    ),
  ),
  2124 => 
  array (
    'name' => '插座',
    'pid' => '2102',
    'cids' => 
    array (
    ),
  ),
  2132 => 
  array (
    'name' => '手动工具',
    'pid' => '2103',
    'cids' => 
    array (
    ),
  ),
  2140 => 
  array (
    'name' => '地垫',
    'pid' => '2138',
    'cids' => 
    array (
    ),
  ),
  2152 => 
  array (
    'name' => '男用器具',
    'pid' => '2156',
    'cids' => 
    array (
    ),
  ),
  2156 => 
  array (
    'name' => '计生用品',
    'pid' => '2150',
    'cids' => 
    array (
      0 => 2153,
      1 => 2152,
      2 => 2154,
      3 => 2155,
      4 => 2157,
      5 => 2158,
    ),
  ),
  7 => 
  array (
    'name' => '气质淑女',
    'pid' => '1',
    'cids' => 
    array (
    ),
  ),
  21 => 
  array (
    'name' => '男士精品',
    'pid' => '0',
    'cids' => 
    array (
      0 => 35,
      1 => 36,
      2 => 37,
      3 => 38,
    ),
  ),
  37 => 
  array (
    'name' => '男包饰物',
    'pid' => '21',
    'cids' => 
    array (
      0 => 1337,
      1 => 1338,
      2 => 1339,
      3 => 1340,
      4 => 1341,
      5 => 1342,
      6 => 1343,
      7 => 1344,
    ),
  ),
  59 => 
  array (
    'name' => '家居睡衣',
    'pid' => '57',
    'cids' => 
    array (
      0 => 1416,
      1 => 1417,
      2 => 1418,
      3 => 1421,
      4 => 2084,
    ),
  ),
  118 => 
  array (
    'name' => '时尚饰品',
    'pid' => '73',
    'cids' => 
    array (
      0 => 1320,
      1 => 1321,
      2 => 1322,
      3 => 1323,
      4 => 1324,
      5 => 1325,
      6 => 1326,
      7 => 1327,
      8 => 1328,
      9 => 1329,
      10 => 1330,
      11 => 1331,
      12 => 1332,
    ),
  ),
  138 => 
  array (
    'name' => '精油香氛',
    'pid' => '134',
    'cids' => 
    array (
      0 => 1373,
      1 => 1374,
    ),
  ),
  164 => 
  array (
    'name' => '婴儿用品',
    'pid' => '162',
    'cids' => 
    array (
      0 => 1591,
      1 => 1592,
      2 => 1603,
      3 => 1629,
      4 => 1630,
      5 => 1642,
      6 => 1634,
      7 => 1593,
      8 => 1594,
      9 => 1595,
      10 => 1596,
      11 => 1597,
      12 => 1598,
      13 => 1599,
      14 => 1600,
      15 => 1601,
      16 => 1602,
    ),
  ),
  176 => 
  array (
    'name' => '宠物生活',
    'pid' => '172',
    'cids' => 
    array (
      0 => 1463,
      1 => 1464,
      2 => 1465,
      3 => 1466,
      4 => 1467,
      5 => 1468,
      6 => 1469,
      7 => 1470,
      8 => 1471,
      9 => 1472,
      10 => 1473,
    ),
  ),
  188 => 
  array (
    'name' => '品牌手表',
    'pid' => '185',
    'cids' => 
    array (
      0 => 1360,
      1 => 1361,
      2 => 1777,
      3 => 1778,
    ),
  ),
  209 => 
  array (
    'name' => '生鲜粮油',
    'pid' => '206',
    'cids' => 
    array (
      0 => 1674,
      1 => 1675,
      2 => 1676,
      3 => 1677,
      4 => 1678,
      5 => 1679,
      6 => 1680,
      7 => 1681,
      8 => 1682,
      9 => 1683,
      10 => 1684,
      11 => 1685,
    ),
  ),
  1231 => 
  array (
    'name' => '厨房电器',
    'pid' => '1224',
    'cids' => 
    array (
      0 => 1804,
      1 => 1805,
      2 => 1806,
      3 => 1807,
      4 => 1808,
      5 => 1809,
      6 => 1810,
      7 => 1811,
    ),
  ),
  1238 => 
  array (
    'name' => '电脑硬件',
    'pid' => '1233',
    'cids' => 
    array (
      0 => 1841,
      1 => 1235,
      2 => 1822,
      3 => 1842,
      4 => 1843,
      5 => 1844,
      6 => 1845,
      7 => 1846,
      8 => 1847,
      9 => 1848,
      10 => 1849,
      11 => 1850,
      12 => 1851,
      13 => 1852,
      14 => 1872,
    ),
  ),
  1252 => 
  array (
    'name' => '运动器械',
    'pid' => '1249',
    'cids' => 
    array (
      0 => 1931,
      1 => 1947,
      2 => 1955,
    ),
  ),
  1257 => 
  array (
    'name' => '内外装饰',
    'pid' => '1254',
    'cids' => 
    array (
      0 => 2005,
      1 => 2013,
    ),
  ),
  1268 => 
  array (
    'name' => '酒具',
    'pid' => '189',
    'cids' => 
    array (
    ),
  ),
  1274 => 
  array (
    'name' => '热销精品',
    'pid' => '1270',
    'cids' => 
    array (
    ),
  ),
  1277 => 
  array (
    'name' => '底衫T恤',
    'pid' => '2',
    'cids' => 
    array (
    ),
  ),
  1291 => 
  array (
    'name' => '夹克',
    'pid' => '35',
    'cids' => 
    array (
    ),
  ),
  1297 => 
  array (
    'name' => '西裤',
    'pid' => '36',
    'cids' => 
    array (
    ),
  ),
  1305 => 
  array (
    'name' => '皮衣',
    'pid' => '1302',
    'cids' => 
    array (
    ),
  ),
  1309 => 
  array (
    'name' => '靴子',
    'pid' => '92',
    'cids' => 
    array (
    ),
  ),
  1313 => 
  array (
    'name' => '正装男鞋',
    'pid' => '38',
    'cids' => 
    array (
    ),
  ),
  1316 => 
  array (
    'name' => '斜挎包',
    'pid' => '99',
    'cids' => 
    array (
    ),
  ),
  1322 => 
  array (
    'name' => '戒指',
    'pid' => '118',
    'cids' => 
    array (
    ),
  ),
  1335 => 
  array (
    'name' => '腰链',
    'pid' => '100',
    'cids' => 
    array (
    ),
  ),
  1339 => 
  array (
    'name' => '公文包',
    'pid' => '37',
    'cids' => 
    array (
    ),
  ),
  1345 => 
  array (
    'name' => '箱包',
    'pid' => '174',
    'cids' => 
    array (
      0 => 1346,
      1 => 1347,
      2 => 1348,
      3 => 1349,
      4 => 1350,
      5 => 1351,
    ),
  ),
  1348 => 
  array (
    'name' => '电脑包',
    'pid' => '1345',
    'cids' => 
    array (
    ),
  ),
  1353 => 
  array (
    'name' => '翡翠',
    'pid' => '186',
    'cids' => 
    array (
    ),
  ),
  1370 => 
  array (
    'name' => '电子表',
    'pid' => '1360',
    'cids' => 
    array (
    ),
  ),
  1372 => 
  array (
    'name' => '眼镜片',
    'pid' => '2087',
    'cids' => 
    array (
    ),
  ),
  1377 => 
  array (
    'name' => '复方精油',
    'pid' => '1373',
    'cids' => 
    array (
    ),
  ),
  1380 => 
  array (
    'name' => '中性香水',
    'pid' => '1374',
    'cids' => 
    array (
    ),
  ),
  1383 => 
  array (
    'name' => '男士护肤',
    'pid' => '135',
    'cids' => 
    array (
      0 => 1572,
      1 => 1573,
      2 => 1574,
      3 => 1575,
      4 => 1576,
      5 => 1577,
      6 => 1578,
      7 => 1579,
    ),
  ),
  1388 => 
  array (
    'name' => '睫毛膏',
    'pid' => '1384',
    'cids' => 
    array (
    ),
  ),
  1400 => 
  array (
    'name' => '双眼皮胶',
    'pid' => '1385',
    'cids' => 
    array (
    ),
  ),
  1406 => 
  array (
    'name' => '洗发护发',
    'pid' => '136',
    'cids' => 
    array (
    ),
  ),
  1414 => 
  array (
    'name' => '内裤',
    'pid' => '58',
    'cids' => 
    array (
    ),
  ),
  1418 => 
  array (
    'name' => '袜子',
    'pid' => '59',
    'cids' => 
    array (
    ),
  ),
  1426 => 
  array (
    'name' => '足浴器',
    'pid' => '175',
    'cids' => 
    array (
    ),
  ),
  1450 => 
  array (
    'name' => '枕头',
    'pid' => '1447',
    'cids' => 
    array (
    ),
  ),
  1465 => 
  array (
    'name' => '服饰',
    'pid' => '176',
    'cids' => 
    array (
    ),
  ),
  1481 => 
  array (
    'name' => '衣物防尘',
    'pid' => '1478',
    'cids' => 
    array (
    ),
  ),
  1497 => 
  array (
    'name' => '沐浴露',
    'pid' => '1494',
    'cids' => 
    array (
    ),
  ),
  1512 => 
  array (
    'name' => '护洗袋',
    'pid' => '1509',
    'cids' => 
    array (
    ),
  ),
  1527 => 
  array (
    'name' => '炖锅',
    'pid' => '1474',
    'cids' => 
    array (
    ),
  ),
  1540 => 
  array (
    'name' => '清洁洗涤',
    'pid' => '173',
    'cids' => 
    array (
    ),
  ),
  1543 => 
  array (
    'name' => '碟',
    'pid' => '1475',
    'cids' => 
    array (
    ),
  ),
  1557 => 
  array (
    'name' => '乳液',
    'pid' => '1381',
    'cids' => 
    array (
    ),
  ),
  1569 => 
  array (
    'name' => '保湿补水',
    'pid' => '1382',
    'cids' => 
    array (
    ),
  ),
  1574 => 
  array (
    'name' => '剃须膏',
    'pid' => '1383',
    'cids' => 
    array (
    ),
  ),
  1582 => 
  array (
    'name' => '果泥',
    'pid' => '163',
    'cids' => 
    array (
    ),
  ),
  1603 => 
  array (
    'name' => '安抚奶嘴',
    'pid' => '164',
    'cids' => 
    array (
    ),
  ),
  1606 => 
  array (
    'name' => '写字板',
    'pid' => '165',
    'cids' => 
    array (
    ),
  ),
  1618 => 
  array (
    'name' => '孕妇奶粉',
    'pid' => '166',
    'cids' => 
    array (
    ),
  ),
  1628 => 
  array (
    'name' => '童车童床',
    'pid' => '221',
    'cids' => 
    array (
      0 => 1632,
      1 => 1631,
      2 => 1636,
      3 => 1637,
      4 => 1638,
      5 => 1639,
      6 => 1635,
      7 => 1640,
      8 => 1641,
      9 => 1633,
    ),
  ),
  1636 => 
  array (
    'name' => '电玩车',
    'pid' => '1628',
    'cids' => 
    array (
    ),
  ),
  1645 => 
  array (
    'name' => '遥控类',
    'pid' => '225',
    'cids' => 
    array (
    ),
  ),
  1652 => 
  array (
    'name' => '无袖T恤',
    'pid' => '223',
    'cids' => 
    array (
    ),
  ),
  1665 => 
  array (
    'name' => '进口烈酒',
    'pid' => '208',
    'cids' => 
    array (
    ),
  ),
  1676 => 
  array (
    'name' => '莲子',
    'pid' => '209',
    'cids' => 
    array (
    ),
  ),
  1687 => 
  array (
    'name' => '螺旋藻',
    'pid' => '210',
    'cids' => 
    array (
    ),
  ),
  1695 => 
  array (
    'name' => '糖果蜜饯',
    'pid' => '207',
    'cids' => 
    array (
      0 => 1753,
      1 => 1754,
      2 => 1755,
      3 => 1756,
      4 => 1757,
      5 => 1758,
      6 => 1759,
      7 => 1760,
      8 => 1761,
      9 => 1762,
      10 => 1763,
      11 => 1764,
    ),
  ),
  1700 => 
  array (
    'name' => '龙井',
    'pid' => '1697',
    'cids' => 
    array (
    ),
  ),
  1716 => 
  array (
    'name' => '燕窝',
    'pid' => '1713',
    'cids' => 
    array (
    ),
  ),
  1730 => 
  array (
    'name' => '鸭肉系列',
    'pid' => '1693',
    'cids' => 
    array (
    ),
  ),
  1741 => 
  array (
    'name' => '纸皮核桃',
    'pid' => '1694',
    'cids' => 
    array (
    ),
  ),
  1755 => 
  array (
    'name' => '奶酪',
    'pid' => '1695',
    'cids' => 
    array (
    ),
  ),
  1768 => 
  array (
    'name' => '烧饼',
    'pid' => '1696',
    'cids' => 
    array (
    ),
  ),
  1777 => 
  array (
    'name' => '情侣表',
    'pid' => '188',
    'cids' => 
    array (
      0 => 1782,
      1 => 1783,
      2 => 1784,
    ),
  ),
  1781 => 
  array (
    'name' => '电子表',
    'pid' => '1361',
    'cids' => 
    array (
    ),
  ),
  1784 => 
  array (
    'name' => '电子表',
    'pid' => '1777',
    'cids' => 
    array (
    ),
  ),
  1787 => 
  array (
    'name' => '电子表',
    'pid' => '1778',
    'cids' => 
    array (
    ),
  ),
  1790 => 
  array (
    'name' => '空调',
    'pid' => '1229',
    'cids' => 
    array (
    ),
  ),
  1797 => 
  array (
    'name' => '加湿器',
    'pid' => '1230',
    'cids' => 
    array (
    ),
  ),
  1806 => 
  array (
    'name' => '料理机',
    'pid' => '1231',
    'cids' => 
    array (
    ),
  ),
  1814 => 
  array (
    'name' => '硬盘播放器',
    'pid' => '1232',
    'cids' => 
    array (
    ),
  ),
  1822 => 
  array (
    'name' => '平板电脑',
    'pid' => '1238',
    'cids' => 
    array (
      0 => 1860,
      1 => 1861,
      2 => 1862,
      3 => 1863,
      4 => 1864,
      5 => 1865,
    ),
  ),
  1828 => 
  array (
    'name' => '直板',
    'pid' => '1234',
    'cids' => 
    array (
    ),
  ),
  1837 => 
  array (
    'name' => '上网本',
    'pid' => '1235',
    'cids' => 
    array (
    ),
  ),
  1855 => 
  array (
    'name' => '投影',
    'pid' => '1823',
    'cids' => 
    array (
    ),
  ),
  1862 => 
  array (
    'name' => '电容触摸',
    'pid' => '1822',
    'cids' => 
    array (
    ),
  ),
  1868 => 
  array (
    'name' => '电子阅览器/电纸书',
    'pid' => '1824',
    'cids' => 
    array (
    ),
  ),
  1874 => 
  array (
    'name' => '蓝牙',
    'pid' => '1825',
    'cids' => 
    array (
    ),
  ),
  1882 => 
  array (
    'name' => '录音笔',
    'pid' => '1821',
    'cids' => 
    array (
    ),
  ),
  1887 => 
  array (
    'name' => '摄像机',
    'pid' => '1236',
    'cids' => 
    array (
    ),
  ),
  1893 => 
  array (
    'name' => '考试',
    'pid' => '1243',
    'cids' => 
    array (
    ),
  ),
  1909 => 
  array (
    'name' => '中国书画',
    'pid' => '1242',
    'cids' => 
    array (
    ),
  ),
  1914 => 
  array (
    'name' => '电影',
    'pid' => '1241',
    'cids' => 
    array (
    ),
  ),
  1923 => 
  array (
    'name' => '笔类/书写工具',
    'pid' => '1240',
    'cids' => 
    array (
    ),
  ),
  1934 => 
  array (
    'name' => '挺腰器',
    'pid' => '1931',
    'cids' => 
    array (
    ),
  ),
  1940 => 
  array (
    'name' => '户外照明',
    'pid' => '1253',
    'cids' => 
    array (
    ),
  ),
  1950 => 
  array (
    'name' => '跳舞毯',
    'pid' => '1947',
    'cids' => 
    array (
    ),
  ),
  1955 => 
  array (
    'name' => '球类运动',
    'pid' => '1252',
    'cids' => 
    array (
      0 => 1956,
      1 => 1957,
      2 => 1958,
      3 => 1959,
      4 => 1960,
      5 => 1961,
    ),
  ),
  1958 => 
  array (
    'name' => '乒乓球',
    'pid' => '1955',
    'cids' => 
    array (
    ),
  ),
  1964 => 
  array (
    'name' => '军服迷彩',
    'pid' => '1890',
    'cids' => 
    array (
    ),
  ),
  1974 => 
  array (
    'name' => '夹克',
    'pid' => '1251',
    'cids' => 
    array (
    ),
  ),
  1983 => 
  array (
    'name' => '篮球鞋',
    'pid' => '1250',
    'cids' => 
    array (
    ),
  ),
  1993 => 
  array (
    'name' => '助力油',
    'pid' => '1990',
    'cids' => 
    array (
    ),
  ),
  2000 => 
  array (
    'name' => '洗车泥',
    'pid' => '1997',
    'cids' => 
    array (
    ),
  ),
  2008 => 
  array (
    'name' => '车贴',
    'pid' => '2005',
    'cids' => 
    array (
    ),
  ),
  2015 => 
  array (
    'name' => '香水香氛',
    'pid' => '2013',
    'cids' => 
    array (
    ),
  ),
  2027 => 
  array (
    'name' => '定位器/跟踪器',
    'pid' => '2024',
    'cids' => 
    array (
    ),
  ),
  2035 => 
  array (
    'name' => '低音炮',
    'pid' => '2031',
    'cids' => 
    array (
    ),
  ),
  2040 => 
  array (
    'name' => '蓝牙',
    'pid' => '1256',
    'cids' => 
    array (
    ),
  ),
  2048 => 
  array (
    'name' => '配件改装',
    'pid' => '1258',
    'cids' => 
    array (
      0 => 2049,
      1 => 2050,
      2 => 2051,
      3 => 2052,
      4 => 2053,
    ),
  ),
  2051 => 
  array (
    'name' => '尾翼',
    'pid' => '2048',
    'cids' => 
    array (
    ),
  ),
  2058 => 
  array (
    'name' => '租车',
    'pid' => '1260',
    'cids' => 
    array (
    ),
  ),
  2063 => 
  array (
    'name' => '生活服务',
    'pid' => '1263',
    'cids' => 
    array (
    ),
  ),
  2072 => 
  array (
    'name' => '本地生活',
    'pid' => '1261',
    'cids' => 
    array (
    ),
  ),
  2078 => 
  array (
    'name' => '物流包装',
    'pid' => '1262',
    'cids' => 
    array (
    ),
  ),
  2092 => 
  array (
    'name' => '品牌乐器',
    'pid' => '2090',
    'cids' => 
    array (
      0 => 2093,
      1 => 2094,
      2 => 2095,
      3 => 2096,
      4 => 2097,
      5 => 2098,
      6 => 2099,
    ),
  ),
  2095 => 
  array (
    'name' => '口琴',
    'pid' => '2092',
    'cids' => 
    array (
    ),
  ),
  2102 => 
  array (
    'name' => '电子/电工',
    'pid' => '1477',
    'cids' => 
    array (
      0 => 2123,
      1 => 2124,
      2 => 2125,
      3 => 2126,
      4 => 2127,
      5 => 2128,
      6 => 2129,
      7 => 2130,
    ),
  ),
  2108 => 
  array (
    'name' => '窗',
    'pid' => '2104',
    'cids' => 
    array (
    ),
  ),
  2114 => 
  array (
    'name' => '卫浴用品',
    'pid' => '2105',
    'cids' => 
    array (
    ),
  ),
  2125 => 
  array (
    'name' => '监控器材及系统',
    'pid' => '2102',
    'cids' => 
    array (
    ),
  ),
  2133 => 
  array (
    'name' => '仪器仪表',
    'pid' => '2103',
    'cids' => 
    array (
    ),
  ),
  2141 => 
  array (
    'name' => '窗帘',
    'pid' => '2138',
    'cids' => 
    array (
    ),
  ),
  2154 => 
  array (
    'name' => '避孕',
    'pid' => '2156',
    'cids' => 
    array (
    ),
  ),
  2160 => 
  array (
    'name' => '医疗器械',
    'pid' => '2150',
    'cids' => 
    array (
    ),
  ),
  6 => 
  array (
    'name' => '休闲运动',
    'pid' => '1',
    'cids' => 
    array (
    ),
  ),
  38 => 
  array (
    'name' => '男士鞋帽',
    'pid' => '21',
    'cids' => 
    array (
      0 => 1299,
      1 => 1300,
      2 => 1313,
    ),
  ),
  73 => 
  array (
    'name' => '女鞋包饰',
    'pid' => '0',
    'cids' => 
    array (
      0 => 92,
      1 => 99,
      2 => 118,
      3 => 100,
    ),
  ),
  100 => 
  array (
    'name' => '时尚配件',
    'pid' => '73',
    'cids' => 
    array (
      0 => 1333,
      1 => 1334,
      2 => 1335,
      3 => 1336,
    ),
  ),
  137 => 
  array (
    'name' => '彩妆造型',
    'pid' => '134',
    'cids' => 
    array (
      0 => 1384,
      1 => 1385,
    ),
  ),
  174 => 
  array (
    'name' => '居家百货',
    'pid' => '172',
    'cids' => 
    array (
      0 => 1509,
      1 => 1478,
      2 => 1345,
      3 => 1432,
      4 => 1433,
      5 => 1434,
      6 => 1435,
      7 => 1436,
      8 => 1437,
      9 => 1438,
      10 => 1439,
      11 => 1440,
      12 => 1441,
      13 => 1442,
      14 => 1443,
      15 => 1444,
      16 => 1445,
      17 => 1446,
    ),
  ),
  210 => 
  array (
    'name' => '营养保健',
    'pid' => '206',
    'cids' => 
    array (
      0 => 1713,
      1 => 1686,
      2 => 1687,
      3 => 1688,
      4 => 1689,
      5 => 1690,
      6 => 1691,
      7 => 1692,
    ),
  ),
  224 => 
  array (
    'name' => '学习教具',
    'pid' => '221',
    'cids' => 
    array (
    ),
  ),
  1232 => 
  array (
    'name' => '影音电器',
    'pid' => '1224',
    'cids' => 
    array (
      0 => 1812,
      1 => 1813,
      2 => 1814,
      3 => 1815,
      4 => 1816,
      5 => 1817,
      6 => 1818,
      7 => 1819,
      8 => 1820,
    ),
  ),
  1242 => 
  array (
    'name' => '古董收藏',
    'pid' => '2090',
    'cids' => 
    array (
      0 => 1907,
      1 => 1908,
      2 => 1909,
      3 => 1910,
      4 => 1911,
    ),
  ),
  1253 => 
  array (
    'name' => '户外装备',
    'pid' => '1249',
    'cids' => 
    array (
      0 => 1890,
      1 => 1939,
      2 => 1940,
      3 => 1941,
      4 => 1942,
      5 => 1943,
      6 => 1944,
      7 => 1945,
      8 => 1946,
    ),
  ),
  1258 => 
  array (
    'name' => '配件养护',
    'pid' => '1254',
    'cids' => 
    array (
      0 => 1990,
      1 => 1997,
      2 => 2048,
    ),
  ),
  1262 => 
  array (
    'name' => '网店定制',
    'pid' => '1259',
    'cids' => 
    array (
      0 => 2077,
      1 => 2078,
      2 => 2079,
      3 => 2080,
      4 => 2081,
      5 => 2083,
    ),
  ),
  1272 => 
  array (
    'name' => '积分专享',
    'pid' => '1270',
    'cids' => 
    array (
    ),
  ),
  1287 => 
  array (
    'name' => '针织衫',
    'pid' => '2',
    'cids' => 
    array (
    ),
  ),
  1293 => 
  array (
    'name' => '西服',
    'pid' => '35',
    'cids' => 
    array (
    ),
  ),
  1306 => 
  array (
    'name' => '马甲',
    'pid' => '1302',
    'cids' => 
    array (
    ),
  ),
  1310 => 
  array (
    'name' => '平底鞋',
    'pid' => '92',
    'cids' => 
    array (
    ),
  ),
  1317 => 
  array (
    'name' => '后背包',
    'pid' => '99',
    'cids' => 
    array (
    ),
  ),
  1323 => 
  array (
    'name' => '发箍',
    'pid' => '118',
    'cids' => 
    array (
    ),
  ),
  1336 => 
  array (
    'name' => '女士腰带',
    'pid' => '100',
    'cids' => 
    array (
    ),
  ),
  1340 => 
  array (
    'name' => '单肩包',
    'pid' => '37',
    'cids' => 
    array (
    ),
  ),
  1349 => 
  array (
    'name' => '相机包',
    'pid' => '1345',
    'cids' => 
    array (
    ),
  ),
  1354 => 
  array (
    'name' => '黄金',
    'pid' => '186',
    'cids' => 
    array (
    ),
  ),
  1371 => 
  array (
    'name' => '功能眼镜',
    'pid' => '2087',
    'cids' => 
    array (
    ),
  ),
  1389 => 
  array (
    'name' => '美甲',
    'pid' => '1384',
    'cids' => 
    array (
    ),
  ),
  1401 => 
  array (
    'name' => '化妆棉',
    'pid' => '1385',
    'cids' => 
    array (
    ),
  ),
  1407 => 
  array (
    'name' => '头发造型',
    'pid' => '136',
    'cids' => 
    array (
    ),
  ),
  1415 => 
  array (
    'name' => '抹胸/吊带背心',
    'pid' => '58',
    'cids' => 
    array (
    ),
  ),
  1421 => 
  array (
    'name' => '保暖',
    'pid' => '59',
    'cids' => 
    array (
    ),
  ),
  1427 => 
  array (
    'name' => '按摩器材',
    'pid' => '175',
    'cids' => 
    array (
    ),
  ),
  1432 => 
  array (
    'name' => '遮阳伞',
    'pid' => '174',
    'cids' => 
    array (
    ),
  ),
  1451 => 
  array (
    'name' => '棉毯',
    'pid' => '1447',
    'cids' => 
    array (
    ),
  ),
  1466 => 
  array (
    'name' => '玩具',
    'pid' => '176',
    'cids' => 
    array (
    ),
  ),
  1482 => 
  array (
    'name' => '收纳盒',
    'pid' => '1478',
    'cids' => 
    array (
    ),
  ),
  1498 => 
  array (
    'name' => '剃须刀',
    'pid' => '1494',
    'cids' => 
    array (
    ),
  ),
  1513 => 
  array (
    'name' => '垃圾袋',
    'pid' => '1509',
    'cids' => 
    array (
    ),
  ),
  1528 => 
  array (
    'name' => '压力锅',
    'pid' => '1474',
    'cids' => 
    array (
    ),
  ),
  1544 => 
  array (
    'name' => '西餐用具',
    'pid' => '1475',
    'cids' => 
    array (
    ),
  ),
  1558 => 
  array (
    'name' => '面霜',
    'pid' => '1381',
    'cids' => 
    array (
    ),
  ),
  1570 => 
  array (
    'name' => '温和清洁',
    'pid' => '1382',
    'cids' => 
    array (
    ),
  ),
  1575 => 
  array (
    'name' => '爽肤水',
    'pid' => '1383',
    'cids' => 
    array (
    ),
  ),
  1583 => 
  array (
    'name' => '肉松',
    'pid' => '163',
    'cids' => 
    array (
    ),
  ),
  1607 => 
  array (
    'name' => '计算架',
    'pid' => '165',
    'cids' => 
    array (
    ),
  ),
  1619 => 
  array (
    'name' => '孕妇营养',
    'pid' => '166',
    'cids' => 
    array (
    ),
  ),
  1629 => 
  array (
    'name' => '婴儿推车',
    'pid' => '164',
    'cids' => 
    array (
    ),
  ),
  1637 => 
  array (
    'name' => '自行车',
    'pid' => '1628',
    'cids' => 
    array (
    ),
  ),
  1646 => 
  array (
    'name' => '桌面',
    'pid' => '225',
    'cids' => 
    array (
    ),
  ),
  1653 => 
  array (
    'name' => '连衣裙',
    'pid' => '223',
    'cids' => 
    array (
    ),
  ),
  1666 => 
  array (
    'name' => '保健酒',
    'pid' => '208',
    'cids' => 
    array (
    ),
  ),
  1677 => 
  array (
    'name' => '食用油',
    'pid' => '209',
    'cids' => 
    array (
    ),
  ),
  1688 => 
  array (
    'name' => '葡萄籽',
    'pid' => '210',
    'cids' => 
    array (
    ),
  ),
  1696 => 
  array (
    'name' => '饼干糕点',
    'pid' => '207',
    'cids' => 
    array (
      0 => 1766,
      1 => 1767,
      2 => 1768,
      3 => 1769,
      4 => 1770,
      5 => 1771,
      6 => 1772,
      7 => 1773,
      8 => 1774,
      9 => 1775,
      10 => 1776,
    ),
  ),
  1701 => 
  array (
    'name' => '铁观音',
    'pid' => '1697',
    'cids' => 
    array (
    ),
  ),
  1717 => 
  array (
    'name' => '西洋参',
    'pid' => '1713',
    'cids' => 
    array (
    ),
  ),
  1731 => 
  array (
    'name' => '鸡肉类',
    'pid' => '1693',
    'cids' => 
    array (
    ),
  ),
  1742 => 
  array (
    'name' => '巴旦木',
    'pid' => '1694',
    'cids' => 
    array (
    ),
  ),
  1756 => 
  array (
    'name' => '布丁',
    'pid' => '1695',
    'cids' => 
    array (
    ),
  ),
  1769 => 
  array (
    'name' => '面包干',
    'pid' => '1696',
    'cids' => 
    array (
    ),
  ),
  1778 => 
  array (
    'name' => '中性表',
    'pid' => '188',
    'cids' => 
    array (
      0 => 1785,
      1 => 1786,
      2 => 1787,
    ),
  ),
  1791 => 
  array (
    'name' => '冰箱',
    'pid' => '1229',
    'cids' => 
    array (
    ),
  ),
  1798 => 
  array (
    'name' => '吸尘器',
    'pid' => '1230',
    'cids' => 
    array (
    ),
  ),
  1807 => 
  array (
    'name' => '酸奶机',
    'pid' => '1231',
    'cids' => 
    array (
    ),
  ),
  1815 => 
  array (
    'name' => '组合音响',
    'pid' => '1232',
    'cids' => 
    array (
    ),
  ),
  1829 => 
  array (
    'name' => '翻盖',
    'pid' => '1234',
    'cids' => 
    array (
    ),
  ),
  1838 => 
  array (
    'name' => '入门机',
    'pid' => '1235',
    'cids' => 
    array (
    ),
  ),
  1842 => 
  array (
    'name' => 'DIY装机',
    'pid' => '1238',
    'cids' => 
    array (
    ),
  ),
  1856 => 
  array (
    'name' => '点钞机',
    'pid' => '1823',
    'cids' => 
    array (
    ),
  ),
  1863 => 
  array (
    'name' => '性能双核',
    'pid' => '1822',
    'cids' => 
    array (
    ),
  ),
  1869 => 
  array (
    'name' => '计算器',
    'pid' => '1824',
    'cids' => 
    array (
    ),
  ),
  1875 => 
  array (
    'name' => '耳机',
    'pid' => '1825',
    'cids' => 
    array (
    ),
  ),
  1884 => 
  array (
    'name' => 'ipod',
    'pid' => '1821',
    'cids' => 
    array (
    ),
  ),
  1888 => 
  array (
    'name' => '单反镜头',
    'pid' => '1236',
    'cids' => 
    array (
    ),
  ),
  1894 => 
  array (
    'name' => '经济',
    'pid' => '1243',
    'cids' => 
    array (
    ),
  ),
  1910 => 
  array (
    'name' => '仿古艺术',
    'pid' => '1242',
    'cids' => 
    array (
    ),
  ),
  1915 => 
  array (
    'name' => '胎教/儿童音像',
    'pid' => '1241',
    'cids' => 
    array (
    ),
  ),
  1925 => 
  array (
    'name' => '文具套装/礼盒',
    'pid' => '1240',
    'cids' => 
    array (
    ),
  ),
  1935 => 
  array (
    'name' => '仰卧板',
    'pid' => '1931',
    'cids' => 
    array (
    ),
  ),
  1941 => 
  array (
    'name' => '睡袋',
    'pid' => '1253',
    'cids' => 
    array (
    ),
  ),
  1951 => 
  array (
    'name' => '棋牌',
    'pid' => '1947',
    'cids' => 
    array (
    ),
  ),
  1959 => 
  array (
    'name' => '篮球',
    'pid' => '1955',
    'cids' => 
    array (
    ),
  ),
  1965 => 
  array (
    'name' => '防晒风衣',
    'pid' => '1890',
    'cids' => 
    array (
    ),
  ),
  1975 => 
  array (
    'name' => '运动长裤',
    'pid' => '1251',
    'cids' => 
    array (
    ),
  ),
  1984 => 
  array (
    'name' => '训练鞋',
    'pid' => '1250',
    'cids' => 
    array (
    ),
  ),
  1994 => 
  array (
    'name' => '玻璃水',
    'pid' => '1990',
    'cids' => 
    array (
    ),
  ),
  2001 => 
  array (
    'name' => '车掸',
    'pid' => '1997',
    'cids' => 
    array (
    ),
  ),
  2009 => 
  array (
    'name' => '车衣',
    'pid' => '2005',
    'cids' => 
    array (
    ),
  ),
  2016 => 
  array (
    'name' => '摆饰',
    'pid' => '2013',
    'cids' => 
    array (
    ),
  ),
  2028 => 
  array (
    'name' => '充电器',
    'pid' => '2024',
    'cids' => 
    array (
    ),
  ),
  2036 => 
  array (
    'name' => '高音喇叭',
    'pid' => '2031',
    'cids' => 
    array (
    ),
  ),
  2041 => 
  array (
    'name' => '冰箱',
    'pid' => '1256',
    'cids' => 
    array (
    ),
  ),
  2052 => 
  array (
    'name' => '车用天线',
    'pid' => '2048',
    'cids' => 
    array (
    ),
  ),
  2059 => 
  array (
    'name' => '签证',
    'pid' => '1260',
    'cids' => 
    array (
    ),
  ),
  2064 => 
  array (
    'name' => '电影卡券',
    'pid' => '1263',
    'cids' => 
    array (
    ),
  ),
  2073 => 
  array (
    'name' => '摄影写真',
    'pid' => '1261',
    'cids' => 
    array (
    ),
  ),
  2079 => 
  array (
    'name' => '电脑软件',
    'pid' => '1262',
    'cids' => 
    array (
    ),
  ),
  2089 => 
  array (
    'name' => '其他',
    'pid' => '189',
    'cids' => 
    array (
      0 => 1267,
    ),
  ),
  2096 => 
  array (
    'name' => '钢琴',
    'pid' => '2092',
    'cids' => 
    array (
    ),
  ),
  2103 => 
  array (
    'name' => '五金/工具',
    'pid' => '1477',
    'cids' => 
    array (
      0 => 2131,
      1 => 2132,
      2 => 2133,
      3 => 2134,
      4 => 2135,
      5 => 2136,
      6 => 2137,
    ),
  ),
  2109 => 
  array (
    'name' => '玻璃',
    'pid' => '2104',
    'cids' => 
    array (
    ),
  ),
  2115 => 
  array (
    'name' => '地板',
    'pid' => '2105',
    'cids' => 
    array (
    ),
  ),
  2126 => 
  array (
    'name' => '电线',
    'pid' => '2102',
    'cids' => 
    array (
    ),
  ),
  2134 => 
  array (
    'name' => '电动工具',
    'pid' => '2103',
    'cids' => 
    array (
    ),
  ),
  2142 => 
  array (
    'name' => '十字绣',
    'pid' => '2138',
    'cids' => 
    array (
    ),
  ),
  2155 => 
  array (
    'name' => '排卵验孕',
    'pid' => '2156',
    'cids' => 
    array (
    ),
  ),
  2161 => 
  array (
    'name' => '隐形眼镜',
    'pid' => '2087',
    'cids' => 
    array (
      0 => 2101,
      1 => 2162,
    ),
  ),
  134 => 
  array (
    'name' => '美妆造型',
    'pid' => '0',
    'cids' => 
    array (
      0 => 135,
      1 => 136,
      2 => 138,
      3 => 137,
    ),
  ),
  163 => 
  array (
    'name' => '婴儿食品',
    'pid' => '162',
    'cids' => 
    array (
      0 => 1580,
      1 => 1581,
      2 => 1582,
      3 => 1583,
      4 => 1584,
      5 => 1585,
      6 => 1586,
      7 => 1587,
      8 => 1588,
      9 => 1589,
      10 => 1590,
    ),
  ),
  1236 => 
  array (
    'name' => '数码相机',
    'pid' => '1821',
    'cids' => 
    array (
      0 => 1885,
      1 => 1886,
      2 => 1887,
      3 => 1888,
      4 => 1889,
    ),
  ),
  1292 => 
  array (
    'name' => '针织衫',
    'pid' => '35',
    'cids' => 
    array (
    ),
  ),
  1311 => 
  array (
    'name' => '中跟鞋',
    'pid' => '92',
    'cids' => 
    array (
    ),
  ),
  1318 => 
  array (
    'name' => '女式钱包',
    'pid' => '99',
    'cids' => 
    array (
    ),
  ),
  1324 => 
  array (
    'name' => '手链',
    'pid' => '118',
    'cids' => 
    array (
    ),
  ),
  1341 => 
  array (
    'name' => '斜挎包',
    'pid' => '37',
    'cids' => 
    array (
    ),
  ),
  1350 => 
  array (
    'name' => '腰包',
    'pid' => '1345',
    'cids' => 
    array (
    ),
  ),
  1355 => 
  array (
    'name' => '天然玉石',
    'pid' => '186',
    'cids' => 
    array (
    ),
  ),
  1390 => 
  array (
    'name' => '粉饼',
    'pid' => '1384',
    'cids' => 
    array (
    ),
  ),
  1402 => 
  array (
    'name' => '化妆镜',
    'pid' => '1385',
    'cids' => 
    array (
    ),
  ),
  1408 => 
  array (
    'name' => '染发烫发',
    'pid' => '136',
    'cids' => 
    array (
    ),
  ),
  1419 => 
  array (
    'name' => '丝袜/打底',
    'pid' => '58',
    'cids' => 
    array (
    ),
  ),
  1428 => 
  array (
    'name' => '电动牙刷',
    'pid' => '175',
    'cids' => 
    array (
    ),
  ),
  1433 => 
  array (
    'name' => '喜糖盒',
    'pid' => '174',
    'cids' => 
    array (
    ),
  ),
  1452 => 
  array (
    'name' => '床单',
    'pid' => '1447',
    'cids' => 
    array (
    ),
  ),
  1467 => 
  array (
    'name' => '狗主食',
    'pid' => '176',
    'cids' => 
    array (
    ),
  ),
  1483 => 
  array (
    'name' => '挂袋',
    'pid' => '1478',
    'cids' => 
    array (
    ),
  ),
  1499 => 
  array (
    'name' => '梳子',
    'pid' => '1494',
    'cids' => 
    array (
    ),
  ),
  1514 => 
  array (
    'name' => '拖把',
    'pid' => '1509',
    'cids' => 
    array (
    ),
  ),
  1529 => 
  array (
    'name' => '刀具',
    'pid' => '1474',
    'cids' => 
    array (
    ),
  ),
  1545 => 
  array (
    'name' => '茶杯',
    'pid' => '1475',
    'cids' => 
    array (
    ),
  ),
  1559 => 
  array (
    'name' => '保湿精华',
    'pid' => '1381',
    'cids' => 
    array (
    ),
  ),
  1571 => 
  array (
    'name' => '急救喷雾',
    'pid' => '1382',
    'cids' => 
    array (
    ),
  ),
  1576 => 
  array (
    'name' => '乳液/面霜',
    'pid' => '1383',
    'cids' => 
    array (
    ),
  ),
  1584 => 
  array (
    'name' => '磨牙棒',
    'pid' => '163',
    'cids' => 
    array (
    ),
  ),
  1608 => 
  array (
    'name' => '儿童包',
    'pid' => '165',
    'cids' => 
    array (
    ),
  ),
  1620 => 
  array (
    'name' => '孕产护肤',
    'pid' => '166',
    'cids' => 
    array (
    ),
  ),
  1630 => 
  array (
    'name' => '婴儿床',
    'pid' => '164',
    'cids' => 
    array (
    ),
  ),
  1638 => 
  array (
    'name' => '滑板车',
    'pid' => '1628',
    'cids' => 
    array (
    ),
  ),
  1647 => 
  array (
    'name' => '模型',
    'pid' => '225',
    'cids' => 
    array (
    ),
  ),
  1654 => 
  array (
    'name' => '半身裙',
    'pid' => '223',
    'cids' => 
    array (
    ),
  ),
  1667 => 
  array (
    'name' => '红葡萄酒',
    'pid' => '208',
    'cids' => 
    array (
    ),
  ),
  1678 => 
  array (
    'name' => '腊肠',
    'pid' => '209',
    'cids' => 
    array (
    ),
  ),
  1689 => 
  array (
    'name' => '左旋肉碱',
    'pid' => '210',
    'cids' => 
    array (
    ),
  ),
  1702 => 
  array (
    'name' => '黑茶',
    'pid' => '1697',
    'cids' => 
    array (
    ),
  ),
  1718 => 
  array (
    'name' => '蜂蜜',
    'pid' => '1713',
    'cids' => 
    array (
    ),
  ),
  1732 => 
  array (
    'name' => '羊肉类',
    'pid' => '1693',
    'cids' => 
    array (
    ),
  ),
  1743 => 
  array (
    'name' => '开心果',
    'pid' => '1694',
    'cids' => 
    array (
    ),
  ),
  1757 => 
  array (
    'name' => '芒果干',
    'pid' => '1695',
    'cids' => 
    array (
    ),
  ),
  1770 => 
  array (
    'name' => '蛋糕',
    'pid' => '1696',
    'cids' => 
    array (
    ),
  ),
  1792 => 
  array (
    'name' => '洗衣机',
    'pid' => '1229',
    'cids' => 
    array (
    ),
  ),
  1799 => 
  array (
    'name' => '空气净化器',
    'pid' => '1230',
    'cids' => 
    array (
    ),
  ),
  1808 => 
  array (
    'name' => '电热水壶',
    'pid' => '1231',
    'cids' => 
    array (
    ),
  ),
  1816 => 
  array (
    'name' => '麦克风',
    'pid' => '1232',
    'cids' => 
    array (
    ),
  ),
  1821 => 
  array (
    'name' => '影音视听',
    'pid' => '1233',
    'cids' => 
    array (
      0 => 1880,
      1 => 1881,
      2 => 1882,
      3 => 1884,
      4 => 1236,
      5 => 2086,
      6 => 1883,
    ),
  ),
  1830 => 
  array (
    'name' => '配件',
    'pid' => '1234',
    'cids' => 
    array (
    ),
  ),
  1839 => 
  array (
    'name' => '影音本',
    'pid' => '1235',
    'cids' => 
    array (
    ),
  ),
  1843 => 
  array (
    'name' => '显示器',
    'pid' => '1238',
    'cids' => 
    array (
    ),
  ),
  1857 => 
  array (
    'name' => '扫描仪',
    'pid' => '1823',
    'cids' => 
    array (
    ),
  ),
  1864 => 
  array (
    'name' => '商务领航',
    'pid' => '1822',
    'cids' => 
    array (
    ),
  ),
  1871 => 
  array (
    'name' => '点读笔',
    'pid' => '1824',
    'cids' => 
    array (
    ),
  ),
  1876 => 
  array (
    'name' => '包包',
    'pid' => '1825',
    'cids' => 
    array (
    ),
  ),
  1889 => 
  array (
    'name' => '配件',
    'pid' => '1236',
    'cids' => 
    array (
    ),
  ),
  1895 => 
  array (
    'name' => '生活',
    'pid' => '1243',
    'cids' => 
    array (
    ),
  ),
  1911 => 
  array (
    'name' => '礼品藏品',
    'pid' => '1242',
    'cids' => 
    array (
    ),
  ),
  1916 => 
  array (
    'name' => '蓝光碟',
    'pid' => '1241',
    'cids' => 
    array (
    ),
  ),
  1926 => 
  array (
    'name' => '橡皮',
    'pid' => '1240',
    'cids' => 
    array (
    ),
  ),
  1936 => 
  array (
    'name' => '健身车',
    'pid' => '1931',
    'cids' => 
    array (
    ),
  ),
  1942 => 
  array (
    'name' => '户外炊具',
    'pid' => '1253',
    'cids' => 
    array (
    ),
  ),
  1952 => 
  array (
    'name' => '民间运动',
    'pid' => '1947',
    'cids' => 
    array (
    ),
  ),
  1960 => 
  array (
    'name' => '足球',
    'pid' => '1955',
    'cids' => 
    array (
    ),
  ),
  1966 => 
  array (
    'name' => '速干衣裤',
    'pid' => '1890',
    'cids' => 
    array (
    ),
  ),
  1976 => 
  array (
    'name' => '训练服',
    'pid' => '1251',
    'cids' => 
    array (
    ),
  ),
  1985 => 
  array (
    'name' => '帆布鞋',
    'pid' => '1250',
    'cids' => 
    array (
    ),
  ),
  1995 => 
  array (
    'name' => '机油添加剂',
    'pid' => '1990',
    'cids' => 
    array (
    ),
  ),
  2002 => 
  array (
    'name' => '车蜡',
    'pid' => '1997',
    'cids' => 
    array (
    ),
  ),
  2010 => 
  array (
    'name' => '扶手箱',
    'pid' => '2005',
    'cids' => 
    array (
    ),
  ),
  2018 => 
  array (
    'name' => '后备箱垫',
    'pid' => '2013',
    'cids' => 
    array (
    ),
  ),
  2029 => 
  array (
    'name' => '地图',
    'pid' => '2024',
    'cids' => 
    array (
    ),
  ),
  2037 => 
  array (
    'name' => '摄像头',
    'pid' => '2031',
    'cids' => 
    array (
    ),
  ),
  2042 => 
  array (
    'name' => '氧吧',
    'pid' => '1256',
    'cids' => 
    array (
    ),
  ),
  2053 => 
  array (
    'name' => '车外灯',
    'pid' => '2048',
    'cids' => 
    array (
    ),
  ),
  2060 => 
  array (
    'name' => '旅游卡券',
    'pid' => '1260',
    'cids' => 
    array (
    ),
  ),
  2065 => 
  array (
    'name' => '体检卡',
    'pid' => '1263',
    'cids' => 
    array (
    ),
  ),
  2074 => 
  array (
    'name' => '电影票',
    'pid' => '1261',
    'cids' => 
    array (
    ),
  ),
  2080 => 
  array (
    'name' => '建站服务',
    'pid' => '1262',
    'cids' => 
    array (
    ),
  ),
  2084 => 
  array (
    'name' => '拖鞋',
    'pid' => '59',
    'cids' => 
    array (
    ),
  ),
  2090 => 
  array (
    'name' => '文化艺术',
    'pid' => '1259',
    'cids' => 
    array (
      0 => 1243,
      1 => 1241,
      2 => 2092,
      3 => 1242,
    ),
  ),
  2097 => 
  array (
    'name' => '提琴',
    'pid' => '2092',
    'cids' => 
    array (
    ),
  ),
  2110 => 
  array (
    'name' => '木方',
    'pid' => '2104',
    'cids' => 
    array (
    ),
  ),
  2116 => 
  array (
    'name' => '墙贴/墙纸/墙布',
    'pid' => '2105',
    'cids' => 
    array (
    ),
  ),
  2127 => 
  array (
    'name' => '断路器',
    'pid' => '2102',
    'cids' => 
    array (
    ),
  ),
  2135 => 
  array (
    'name' => '机电五金',
    'pid' => '2103',
    'cids' => 
    array (
    ),
  ),
  2143 => 
  array (
    'name' => '刺绣',
    'pid' => '2138',
    'cids' => 
    array (
    ),
  ),
  2157 => 
  array (
    'name' => '清洁抗菌',
    'pid' => '2156',
    'cids' => 
    array (
    ),
  ),
  57 => 
  array (
    'name' => '品质内衣',
    'pid' => '0',
    'cids' => 
    array (
      0 => 58,
      1 => 61,
      2 => 59,
    ),
  ),
  1267 => 
  array (
    'name' => '瑞士军刀',
    'pid' => '2089',
    'cids' => 
    array (
    ),
  ),
  1302 => 
  array (
    'name' => '秋冬保暖',
    'pid' => '35',
    'cids' => 
    array (
      0 => 1303,
      1 => 1304,
      2 => 1305,
      3 => 1306,
    ),
  ),
  1312 => 
  array (
    'name' => '高跟鞋',
    'pid' => '92',
    'cids' => 
    array (
    ),
  ),
  1319 => 
  array (
    'name' => '晚宴包',
    'pid' => '99',
    'cids' => 
    array (
    ),
  ),
  1325 => 
  array (
    'name' => '胸针',
    'pid' => '118',
    'cids' => 
    array (
    ),
  ),
  1342 => 
  array (
    'name' => '手拿包',
    'pid' => '37',
    'cids' => 
    array (
    ),
  ),
  1351 => 
  array (
    'name' => '卡套',
    'pid' => '1345',
    'cids' => 
    array (
    ),
  ),
  1356 => 
  array (
    'name' => '珍珠',
    'pid' => '186',
    'cids' => 
    array (
    ),
  ),
  1391 => 
  array (
    'name' => '粉底液',
    'pid' => '1384',
    'cids' => 
    array (
    ),
  ),
  1403 => 
  array (
    'name' => '化妆刷',
    'pid' => '1385',
    'cids' => 
    array (
    ),
  ),
  1409 => 
  array (
    'name' => '美颈',
    'pid' => '136',
    'cids' => 
    array (
    ),
  ),
  1420 => 
  array (
    'name' => '塑身衣',
    'pid' => '58',
    'cids' => 
    array (
    ),
  ),
  1429 => 
  array (
    'name' => '体重秤',
    'pid' => '175',
    'cids' => 
    array (
    ),
  ),
  1434 => 
  array (
    'name' => '钟',
    'pid' => '174',
    'cids' => 
    array (
    ),
  ),
  1453 => 
  array (
    'name' => '婚庆床品',
    'pid' => '1447',
    'cids' => 
    array (
    ),
  ),
  1468 => 
  array (
    'name' => '狗零食',
    'pid' => '176',
    'cids' => 
    array (
    ),
  ),
  1484 => 
  array (
    'name' => '挂钩',
    'pid' => '1478',
    'cids' => 
    array (
    ),
  ),
  1500 => 
  array (
    'name' => '香薰',
    'pid' => '1494',
    'cids' => 
    array (
    ),
  ),
  1523 => 
  array (
    'name' => '除尘',
    'pid' => '1509',
    'cids' => 
    array (
    ),
  ),
  1530 => 
  array (
    'name' => '蒸锅',
    'pid' => '1474',
    'cids' => 
    array (
    ),
  ),
  1546 => 
  array (
    'name' => '酒具',
    'pid' => '1475',
    'cids' => 
    array (
    ),
  ),
  1560 => 
  array (
    'name' => '眼部护理',
    'pid' => '1381',
    'cids' => 
    array (
    ),
  ),
  1577 => 
  array (
    'name' => '眼霜',
    'pid' => '1383',
    'cids' => 
    array (
    ),
  ),
  1585 => 
  array (
    'name' => '牛初乳',
    'pid' => '163',
    'cids' => 
    array (
    ),
  ),
  1609 => 
  array (
    'name' => '爬行毯',
    'pid' => '165',
    'cids' => 
    array (
    ),
  ),
  1621 => 
  array (
    'name' => '吸奶器',
    'pid' => '166',
    'cids' => 
    array (
    ),
  ),
  1639 => 
  array (
    'name' => '扭扭车',
    'pid' => '1628',
    'cids' => 
    array (
    ),
  ),
  1642 => 
  array (
    'name' => '婴儿枕',
    'pid' => '164',
    'cids' => 
    array (
    ),
  ),
  1648 => 
  array (
    'name' => '动漫',
    'pid' => '225',
    'cids' => 
    array (
    ),
  ),
  1655 => 
  array (
    'name' => '吊带/背心',
    'pid' => '223',
    'cids' => 
    array (
    ),
  ),
  1668 => 
  array (
    'name' => '白葡萄酒',
    'pid' => '208',
    'cids' => 
    array (
    ),
  ),
  1679 => 
  array (
    'name' => '木耳',
    'pid' => '209',
    'cids' => 
    array (
    ),
  ),
  1690 => 
  array (
    'name' => '维生素E',
    'pid' => '210',
    'cids' => 
    array (
    ),
  ),
  1703 => 
  array (
    'name' => '花茶',
    'pid' => '1697',
    'cids' => 
    array (
    ),
  ),
  1719 => 
  array (
    'name' => '人参',
    'pid' => '1713',
    'cids' => 
    array (
    ),
  ),
  1733 => 
  array (
    'name' => '鱿鱼系列',
    'pid' => '1693',
    'cids' => 
    array (
    ),
  ),
  1744 => 
  array (
    'name' => '夏威夷果',
    'pid' => '1694',
    'cids' => 
    array (
    ),
  ),
  1758 => 
  array (
    'name' => '枣类',
    'pid' => '1695',
    'cids' => 
    array (
    ),
  ),
  1771 => 
  array (
    'name' => '月饼',
    'pid' => '1696',
    'cids' => 
    array (
    ),
  ),
  1793 => 
  array (
    'name' => '油烟机',
    'pid' => '1229',
    'cids' => 
    array (
    ),
  ),
  1800 => 
  array (
    'name' => '扫地机',
    'pid' => '1230',
    'cids' => 
    array (
    ),
  ),
  1809 => 
  array (
    'name' => '电炖锅',
    'pid' => '1231',
    'cids' => 
    array (
    ),
  ),
  1817 => 
  array (
    'name' => '低音炮',
    'pid' => '1232',
    'cids' => 
    array (
    ),
  ),
  1831 => 
  array (
    'name' => 'Andriod',
    'pid' => '1234',
    'cids' => 
    array (
    ),
  ),
  1840 => 
  array (
    'name' => '配件',
    'pid' => '1235',
    'cids' => 
    array (
    ),
  ),
  1844 => 
  array (
    'name' => '主机',
    'pid' => '1238',
    'cids' => 
    array (
    ),
  ),
  1858 => 
  array (
    'name' => '办公耗材',
    'pid' => '1823',
    'cids' => 
    array (
    ),
  ),
  1865 => 
  array (
    'name' => '便携游戏',
    'pid' => '1822',
    'cids' => 
    array (
    ),
  ),
  1877 => 
  array (
    'name' => '电池',
    'pid' => '1825',
    'cids' => 
    array (
    ),
  ),
  1896 => 
  array (
    'name' => '杂志',
    'pid' => '1243',
    'cids' => 
    array (
    ),
  ),
  1917 => 
  array (
    'name' => '瑜伽',
    'pid' => '1241',
    'cids' => 
    array (
    ),
  ),
  1927 => 
  array (
    'name' => '印章/印泥/印台',
    'pid' => '1240',
    'cids' => 
    array (
    ),
  ),
  1937 => 
  array (
    'name' => '瑜伽',
    'pid' => '1931',
    'cids' => 
    array (
    ),
  ),
  1943 => 
  array (
    'name' => '户外包',
    'pid' => '1253',
    'cids' => 
    array (
    ),
  ),
  1953 => 
  array (
    'name' => '电动车',
    'pid' => '1947',
    'cids' => 
    array (
    ),
  ),
  1961 => 
  array (
    'name' => '运动护具',
    'pid' => '1955',
    'cids' => 
    array (
    ),
  ),
  1967 => 
  array (
    'name' => '徒步鞋',
    'pid' => '1890',
    'cids' => 
    array (
    ),
  ),
  1977 => 
  array (
    'name' => '运动套装',
    'pid' => '1251',
    'cids' => 
    array (
    ),
  ),
  1986 => 
  array (
    'name' => '足球鞋',
    'pid' => '1250',
    'cids' => 
    array (
    ),
  ),
  1996 => 
  array (
    'name' => '汽油添加剂',
    'pid' => '1990',
    'cids' => 
    array (
    ),
  ),
  2003 => 
  array (
    'name' => '补漆笔',
    'pid' => '1997',
    'cids' => 
    array (
    ),
  ),
  2011 => 
  array (
    'name' => '后视镜',
    'pid' => '2005',
    'cids' => 
    array (
    ),
  ),
  2019 => 
  array (
    'name' => '置物箱',
    'pid' => '2013',
    'cids' => 
    array (
    ),
  ),
  2030 => 
  array (
    'name' => '支架',
    'pid' => '2024',
    'cids' => 
    array (
    ),
  ),
  2038 => 
  array (
    'name' => '行车记录仪',
    'pid' => '2031',
    'cids' => 
    array (
    ),
  ),
  2043 => 
  array (
    'name' => '手机充电器',
    'pid' => '1256',
    'cids' => 
    array (
    ),
  ),
  2066 => 
  array (
    'name' => '体育赛事',
    'pid' => '1263',
    'cids' => 
    array (
    ),
  ),
  2069 => 
  array (
    'name' => '酒店预订',
    'pid' => '1260',
    'cids' => 
    array (
    ),
  ),
  2075 => 
  array (
    'name' => '演出赛事',
    'pid' => '1261',
    'cids' => 
    array (
    ),
  ),
  2081 => 
  array (
    'name' => '网店装修',
    'pid' => '1262',
    'cids' => 
    array (
    ),
  ),
  2086 => 
  array (
    'name' => 'DV摄影',
    'pid' => '1821',
    'cids' => 
    array (
    ),
  ),
  2098 => 
  array (
    'name' => '萨克斯',
    'pid' => '2092',
    'cids' => 
    array (
    ),
  ),
  2101 => 
  array (
    'name' => '美瞳/彩色隐形眼镜',
    'pid' => '2161',
    'cids' => 
    array (
    ),
  ),
  2111 => 
  array (
    'name' => '石膏板',
    'pid' => '2104',
    'cids' => 
    array (
    ),
  ),
  2117 => 
  array (
    'name' => '照明/光源',
    'pid' => '2105',
    'cids' => 
    array (
    ),
  ),
  2128 => 
  array (
    'name' => '接线板/插头',
    'pid' => '2102',
    'cids' => 
    array (
    ),
  ),
  2136 => 
  array (
    'name' => '气动工具',
    'pid' => '2103',
    'cids' => 
    array (
    ),
  ),
  2144 => 
  array (
    'name' => '盖巾',
    'pid' => '2138',
    'cids' => 
    array (
    ),
  ),
  2158 => 
  array (
    'name' => '润滑剂',
    'pid' => '2156',
    'cids' => 
    array (
    ),
  ),
  162 => 
  array (
    'name' => '母婴用品',
    'pid' => '0',
    'cids' => 
    array (
      0 => 165,
      1 => 166,
      2 => 164,
      3 => 163,
    ),
  ),
  1326 => 
  array (
    'name' => '银饰',
    'pid' => '118',
    'cids' => 
    array (
    ),
  ),
  1343 => 
  array (
    'name' => '男士钱包',
    'pid' => '37',
    'cids' => 
    array (
    ),
  ),
  1357 => 
  array (
    'name' => '宝石',
    'pid' => '186',
    'cids' => 
    array (
    ),
  ),
  1392 => 
  array (
    'name' => '眼线',
    'pid' => '1384',
    'cids' => 
    array (
    ),
  ),
  1410 => 
  array (
    'name' => '唇部护理',
    'pid' => '136',
    'cids' => 
    array (
    ),
  ),
  1430 => 
  array (
    'name' => '卷/直发器',
    'pid' => '175',
    'cids' => 
    array (
    ),
  ),
  1435 => 
  array (
    'name' => '健康秤',
    'pid' => '174',
    'cids' => 
    array (
    ),
  ),
  1454 => 
  array (
    'name' => '记忆枕',
    'pid' => '1447',
    'cids' => 
    array (
    ),
  ),
  1469 => 
  array (
    'name' => '牵引绳',
    'pid' => '176',
    'cids' => 
    array (
    ),
  ),
  1485 => 
  array (
    'name' => '收纳凳',
    'pid' => '1478',
    'cids' => 
    array (
    ),
  ),
  1501 => 
  array (
    'name' => '卫生巾',
    'pid' => '1494',
    'cids' => 
    array (
    ),
  ),
  1515 => 
  array (
    'name' => '百洁布',
    'pid' => '1509',
    'cids' => 
    array (
    ),
  ),
  1531 => 
  array (
    'name' => '汤锅',
    'pid' => '1474',
    'cids' => 
    array (
    ),
  ),
  1547 => 
  array (
    'name' => '筷子',
    'pid' => '1475',
    'cids' => 
    array (
    ),
  ),
  1561 => 
  array (
    'name' => '护肤套装',
    'pid' => '1381',
    'cids' => 
    array (
    ),
  ),
  1578 => 
  array (
    'name' => '面膜',
    'pid' => '1383',
    'cids' => 
    array (
    ),
  ),
  1586 => 
  array (
    'name' => '鱼肝油',
    'pid' => '163',
    'cids' => 
    array (
    ),
  ),
  1610 => 
  array (
    'name' => '玩具车',
    'pid' => '165',
    'cids' => 
    array (
    ),
  ),
  1622 => 
  array (
    'name' => '防溢乳垫',
    'pid' => '166',
    'cids' => 
    array (
    ),
  ),
  1634 => 
  array (
    'name' => '床铃',
    'pid' => '164',
    'cids' => 
    array (
    ),
  ),
  1635 => 
  array (
    'name' => '餐椅',
    'pid' => '1628',
    'cids' => 
    array (
    ),
  ),
  1649 => 
  array (
    'name' => '魔术',
    'pid' => '225',
    'cids' => 
    array (
    ),
  ),
  1656 => 
  array (
    'name' => '长裤',
    'pid' => '223',
    'cids' => 
    array (
    ),
  ),
  1669 => 
  array (
    'name' => '起泡酒',
    'pid' => '208',
    'cids' => 
    array (
    ),
  ),
  1680 => 
  array (
    'name' => '香菇',
    'pid' => '209',
    'cids' => 
    array (
    ),
  ),
  1691 => 
  array (
    'name' => '钙片',
    'pid' => '210',
    'cids' => 
    array (
    ),
  ),
  1704 => 
  array (
    'name' => '普洱',
    'pid' => '1697',
    'cids' => 
    array (
    ),
  ),
  1720 => 
  array (
    'name' => '阿胶',
    'pid' => '1713',
    'cids' => 
    array (
    ),
  ),
  1734 => 
  array (
    'name' => '鱼系列',
    'pid' => '1693',
    'cids' => 
    array (
    ),
  ),
  1745 => 
  array (
    'name' => '松子',
    'pid' => '1694',
    'cids' => 
    array (
    ),
  ),
  1759 => 
  array (
    'name' => '梅类',
    'pid' => '1695',
    'cids' => 
    array (
    ),
  ),
  1772 => 
  array (
    'name' => '粽子',
    'pid' => '1696',
    'cids' => 
    array (
    ),
  ),
  1794 => 
  array (
    'name' => '燃气灶',
    'pid' => '1229',
    'cids' => 
    array (
    ),
  ),
  1801 => 
  array (
    'name' => '干衣机',
    'pid' => '1230',
    'cids' => 
    array (
    ),
  ),
  1810 => 
  array (
    'name' => '饮水机',
    'pid' => '1231',
    'cids' => 
    array (
    ),
  ),
  1818 => 
  array (
    'name' => '影碟机',
    'pid' => '1232',
    'cids' => 
    array (
    ),
  ),
  1824 => 
  array (
    'name' => '电子文具',
    'pid' => '1239',
    'cids' => 
    array (
      0 => 1866,
      1 => 1867,
      2 => 1868,
      3 => 1869,
      4 => 1871,
    ),
  ),
  1832 => 
  array (
    'name' => 'iPhone系列',
    'pid' => '1234',
    'cids' => 
    array (
    ),
  ),
  1845 => 
  array (
    'name' => '显卡',
    'pid' => '1238',
    'cids' => 
    array (
    ),
  ),
  1859 => 
  array (
    'name' => '传真/通信设备',
    'pid' => '1823',
    'cids' => 
    array (
    ),
  ),
  1878 => 
  array (
    'name' => '上网卡',
    'pid' => '1825',
    'cids' => 
    array (
    ),
  ),
  1883 => 
  array (
    'name' => '配件',
    'pid' => '1821',
    'cids' => 
    array (
    ),
  ),
  1897 => 
  array (
    'name' => '励志',
    'pid' => '1243',
    'cids' => 
    array (
    ),
  ),
  1918 => 
  array (
    'name' => '生活百科',
    'pid' => '1241',
    'cids' => 
    array (
    ),
  ),
  1928 => 
  array (
    'name' => '文件/照片/CD收纳',
    'pid' => '1240',
    'cids' => 
    array (
    ),
  ),
  1938 => 
  array (
    'name' => '舞蹈',
    'pid' => '1931',
    'cids' => 
    array (
    ),
  ),
  1944 => 
  array (
    'name' => '垫子地席',
    'pid' => '1253',
    'cids' => 
    array (
    ),
  ),
  1954 => 
  array (
    'name' => '高尔夫',
    'pid' => '1947',
    'cids' => 
    array (
    ),
  ),
  1968 => 
  array (
    'name' => '登山鞋',
    'pid' => '1890',
    'cids' => 
    array (
    ),
  ),
  1978 => 
  array (
    'name' => '短袖',
    'pid' => '1251',
    'cids' => 
    array (
    ),
  ),
  1987 => 
  array (
    'name' => '羽毛球鞋',
    'pid' => '1250',
    'cids' => 
    array (
    ),
  ),
  2004 => 
  array (
    'name' => '车釉',
    'pid' => '1997',
    'cids' => 
    array (
    ),
  ),
  2012 => 
  array (
    'name' => '雨刮器',
    'pid' => '2005',
    'cids' => 
    array (
    ),
  ),
  2020 => 
  array (
    'name' => '儿童安全座椅',
    'pid' => '2013',
    'cids' => 
    array (
    ),
  ),
  2044 => 
  array (
    'name' => '充气泵',
    'pid' => '1256',
    'cids' => 
    array (
    ),
  ),
  2067 => 
  array (
    'name' => '提货券',
    'pid' => '1263',
    'cids' => 
    array (
    ),
  ),
  2076 => 
  array (
    'name' => '景点门票',
    'pid' => '1261',
    'cids' => 
    array (
    ),
  ),
  2083 => 
  array (
    'name' => '定制礼物',
    'pid' => '1262',
    'cids' => 
    array (
    ),
  ),
  2091 => 
  array (
    'name' => '车船机票',
    'pid' => '1260',
    'cids' => 
    array (
    ),
  ),
  2099 => 
  array (
    'name' => '西洋鼓',
    'pid' => '2092',
    'cids' => 
    array (
    ),
  ),
  2112 => 
  array (
    'name' => '天然大理石',
    'pid' => '2104',
    'cids' => 
    array (
    ),
  ),
  2118 => 
  array (
    'name' => '环保/除味/保养',
    'pid' => '2105',
    'cids' => 
    array (
    ),
  ),
  2129 => 
  array (
    'name' => '防盗报警器材及系统',
    'pid' => '2102',
    'cids' => 
    array (
    ),
  ),
  2137 => 
  array (
    'name' => '机械五金',
    'pid' => '2103',
    'cids' => 
    array (
    ),
  ),
  2145 => 
  array (
    'name' => '卷帘',
    'pid' => '2138',
    'cids' => 
    array (
    ),
  ),
  221 => 
  array (
    'name' => '儿童专场',
    'pid' => '0',
    'cids' => 
    array (
      0 => 223,
      1 => 225,
      2 => 1628,
      3 => 224,
    ),
  ),
  1327 => 
  array (
    'name' => '头饰',
    'pid' => '118',
    'cids' => 
    array (
    ),
  ),
  1344 => 
  array (
    'name' => '手提包',
    'pid' => '37',
    'cids' => 
    array (
    ),
  ),
  1358 => 
  array (
    'name' => '铂金',
    'pid' => '186',
    'cids' => 
    array (
    ),
  ),
  1393 => 
  array (
    'name' => '眼影遮瑕',
    'pid' => '1384',
    'cids' => 
    array (
    ),
  ),
  1411 => 
  array (
    'name' => '足部护理',
    'pid' => '136',
    'cids' => 
    array (
    ),
  ),
  1431 => 
  array (
    'name' => '血压计',
    'pid' => '175',
    'cids' => 
    array (
    ),
  ),
  1436 => 
  array (
    'name' => '碳包',
    'pid' => '174',
    'cids' => 
    array (
    ),
  ),
  1455 => 
  array (
    'name' => '枕套韩式',
    'pid' => '1447',
    'cids' => 
    array (
    ),
  ),
  1470 => 
  array (
    'name' => '日用品',
    'pid' => '176',
    'cids' => 
    array (
    ),
  ),
  1486 => 
  array (
    'name' => '纸巾盒',
    'pid' => '1478',
    'cids' => 
    array (
    ),
  ),
  1502 => 
  array (
    'name' => '沐浴球',
    'pid' => '1494',
    'cids' => 
    array (
    ),
  ),
  1516 => 
  array (
    'name' => '除甲醛',
    'pid' => '1509',
    'cids' => 
    array (
    ),
  ),
  1532 => 
  array (
    'name' => '烧水壶',
    'pid' => '1474',
    'cids' => 
    array (
    ),
  ),
  1548 => 
  array (
    'name' => '咖啡杯',
    'pid' => '1475',
    'cids' => 
    array (
    ),
  ),
  1562 => 
  array (
    'name' => '面膜',
    'pid' => '1381',
    'cids' => 
    array (
    ),
  ),
  1579 => 
  array (
    'name' => '护唇',
    'pid' => '1383',
    'cids' => 
    array (
    ),
  ),
  1587 => 
  array (
    'name' => '钙铁锌',
    'pid' => '163',
    'cids' => 
    array (
    ),
  ),
  1593 => 
  array (
    'name' => '纸尿裤',
    'pid' => '164',
    'cids' => 
    array (
    ),
  ),
  1611 => 
  array (
    'name' => '早教书籍',
    'pid' => '165',
    'cids' => 
    array (
    ),
  ),
  1623 => 
  array (
    'name' => '月子餐',
    'pid' => '166',
    'cids' => 
    array (
    ),
  ),
  1640 => 
  array (
    'name' => '床围',
    'pid' => '1628',
    'cids' => 
    array (
    ),
  ),
  1657 => 
  array (
    'name' => '短裤',
    'pid' => '223',
    'cids' => 
    array (
    ),
  ),
  1670 => 
  array (
    'name' => '黄酒',
    'pid' => '208',
    'cids' => 
    array (
    ),
  ),
  1681 => 
  array (
    'name' => '调味品',
    'pid' => '209',
    'cids' => 
    array (
    ),
  ),
  1692 => 
  array (
    'name' => '维生素C',
    'pid' => '210',
    'cids' => 
    array (
    ),
  ),
  1705 => 
  array (
    'name' => '七子饼',
    'pid' => '1697',
    'cids' => 
    array (
    ),
  ),
  1721 => 
  array (
    'name' => '固元膏',
    'pid' => '1713',
    'cids' => 
    array (
    ),
  ),
  1735 => 
  array (
    'name' => '虾系列',
    'pid' => '1693',
    'cids' => 
    array (
    ),
  ),
  1746 => 
  array (
    'name' => '榛子',
    'pid' => '1694',
    'cids' => 
    array (
    ),
  ),
  1760 => 
  array (
    'name' => '杏干',
    'pid' => '1695',
    'cids' => 
    array (
    ),
  ),
  1773 => 
  array (
    'name' => '糙米卷',
    'pid' => '1696',
    'cids' => 
    array (
    ),
  ),
  1795 => 
  array (
    'name' => '烟灶消套装',
    'pid' => '1229',
    'cids' => 
    array (
    ),
  ),
  1802 => 
  array (
    'name' => '电熨斗',
    'pid' => '1230',
    'cids' => 
    array (
    ),
  ),
  1811 => 
  array (
    'name' => '面包机',
    'pid' => '1231',
    'cids' => 
    array (
    ),
  ),
  1819 => 
  array (
    'name' => '复读机',
    'pid' => '1232',
    'cids' => 
    array (
    ),
  ),
  1825 => 
  array (
    'name' => '3C配件',
    'pid' => '1233',
    'cids' => 
    array (
      0 => 1873,
      1 => 1874,
      2 => 1875,
      3 => 1876,
      4 => 1877,
      5 => 1878,
      6 => 1879,
    ),
  ),
  1833 => 
  array (
    'name' => '1000-2000元',
    'pid' => '1234',
    'cids' => 
    array (
    ),
  ),
  1846 => 
  array (
    'name' => '光驱',
    'pid' => '1238',
    'cids' => 
    array (
    ),
  ),
  1879 => 
  array (
    'name' => '配件',
    'pid' => '1825',
    'cids' => 
    array (
    ),
  ),
  1898 => 
  array (
    'name' => '儿童',
    'pid' => '1243',
    'cids' => 
    array (
    ),
  ),
  1919 => 
  array (
    'name' => '戏曲曲艺',
    'pid' => '1241',
    'cids' => 
    array (
    ),
  ),
  1929 => 
  array (
    'name' => '书签',
    'pid' => '1240',
    'cids' => 
    array (
    ),
  ),
  1945 => 
  array (
    'name' => '帐篷',
    'pid' => '1253',
    'cids' => 
    array (
    ),
  ),
  1969 => 
  array (
    'name' => '越野跑鞋',
    'pid' => '1890',
    'cids' => 
    array (
    ),
  ),
  1979 => 
  array (
    'name' => '篮球背心',
    'pid' => '1251',
    'cids' => 
    array (
    ),
  ),
  1988 => 
  array (
    'name' => '兵乓球鞋',
    'pid' => '1250',
    'cids' => 
    array (
    ),
  ),
  2021 => 
  array (
    'name' => '遮阳档',
    'pid' => '2013',
    'cids' => 
    array (
    ),
  ),
  2046 => 
  array (
    'name' => '抛光机',
    'pid' => '1997',
    'cids' => 
    array (
    ),
  ),
  2054 => 
  array (
    'name' => '安全行驶用品',
    'pid' => '1256',
    'cids' => 
    array (
    ),
  ),
  2068 => 
  array (
    'name' => '教育培训',
    'pid' => '1263',
    'cids' => 
    array (
    ),
  ),
  2119 => 
  array (
    'name' => '集成吊顶',
    'pid' => '2105',
    'cids' => 
    array (
    ),
  ),
  2130 => 
  array (
    'name' => '布线箱',
    'pid' => '2102',
    'cids' => 
    array (
    ),
  ),
  2146 => 
  array (
    'name' => '百叶帘',
    'pid' => '2138',
    'cids' => 
    array (
    ),
  ),
  172 => 
  array (
    'name' => '居家生活',
    'pid' => '0',
    'cids' => 
    array (
      0 => 1447,
      1 => 1494,
      2 => 176,
      3 => 174,
    ),
  ),
  1328 => 
  array (
    'name' => '情侣对饰',
    'pid' => '118',
    'cids' => 
    array (
    ),
  ),
  1394 => 
  array (
    'name' => '唇膏',
    'pid' => '1384',
    'cids' => 
    array (
    ),
  ),
  1437 => 
  array (
    'name' => '浴室套件',
    'pid' => '174',
    'cids' => 
    array (
    ),
  ),
  1456 => 
  array (
    'name' => '简约',
    'pid' => '1447',
    'cids' => 
    array (
    ),
  ),
  1471 => 
  array (
    'name' => '清洁美容',
    'pid' => '176',
    'cids' => 
    array (
    ),
  ),
  1487 => 
  array (
    'name' => '首饰盒',
    'pid' => '1478',
    'cids' => 
    array (
    ),
  ),
  1503 => 
  array (
    'name' => '洁面',
    'pid' => '1494',
    'cids' => 
    array (
    ),
  ),
  1524 => 
  array (
    'name' => '防蛀',
    'pid' => '1509',
    'cids' => 
    array (
    ),
  ),
  1533 => 
  array (
    'name' => '烘焙',
    'pid' => '1474',
    'cids' => 
    array (
    ),
  ),
  1549 => 
  array (
    'name' => '茶壶',
    'pid' => '1475',
    'cids' => 
    array (
    ),
  ),
  1566 => 
  array (
    'name' => '防晒',
    'pid' => '1381',
    'cids' => 
    array (
    ),
  ),
  1588 => 
  array (
    'name' => '羊奶粉',
    'pid' => '163',
    'cids' => 
    array (
    ),
  ),
  1594 => 
  array (
    'name' => '湿巾',
    'pid' => '164',
    'cids' => 
    array (
    ),
  ),
  1612 => 
  array (
    'name' => '智能玩具',
    'pid' => '165',
    'cids' => 
    array (
    ),
  ),
  1624 => 
  array (
    'name' => '护腰枕',
    'pid' => '166',
    'cids' => 
    array (
    ),
  ),
  1641 => 
  array (
    'name' => '床垫',
    'pid' => '1628',
    'cids' => 
    array (
    ),
  ),
  1658 => 
  array (
    'name' => '五/七分裤',
    'pid' => '223',
    'cids' => 
    array (
    ),
  ),
  1671 => 
  array (
    'name' => '烧酒',
    'pid' => '208',
    'cids' => 
    array (
    ),
  ),
  1682 => 
  array (
    'name' => '干贝',
    'pid' => '209',
    'cids' => 
    array (
    ),
  ),
  1706 => 
  array (
    'name' => '咖啡',
    'pid' => '1697',
    'cids' => 
    array (
    ),
  ),
  1722 => 
  array (
    'name' => '鹿茸',
    'pid' => '1713',
    'cids' => 
    array (
    ),
  ),
  1736 => 
  array (
    'name' => '海苔系列',
    'pid' => '1693',
    'cids' => 
    array (
    ),
  ),
  1747 => 
  array (
    'name' => '杏仁',
    'pid' => '1694',
    'cids' => 
    array (
    ),
  ),
  1761 => 
  array (
    'name' => '葡萄干',
    'pid' => '1695',
    'cids' => 
    array (
    ),
  ),
  1774 => 
  array (
    'name' => '浪味仙',
    'pid' => '1696',
    'cids' => 
    array (
    ),
  ),
  1803 => 
  array (
    'name' => '挂烫机',
    'pid' => '1230',
    'cids' => 
    array (
    ),
  ),
  1820 => 
  array (
    'name' => '收录机',
    'pid' => '1232',
    'cids' => 
    array (
    ),
  ),
  1834 => 
  array (
    'name' => '2000-3000元',
    'pid' => '1234',
    'cids' => 
    array (
    ),
  ),
  1847 => 
  array (
    'name' => '鼠标',
    'pid' => '1238',
    'cids' => 
    array (
    ),
  ),
  1899 => 
  array (
    'name' => '语言',
    'pid' => '1243',
    'cids' => 
    array (
    ),
  ),
  1920 => 
  array (
    'name' => '教育音像',
    'pid' => '1241',
    'cids' => 
    array (
    ),
  ),
  1930 => 
  array (
    'name' => '其它',
    'pid' => '1240',
    'cids' => 
    array (
    ),
  ),
  1946 => 
  array (
    'name' => '渔具',
    'pid' => '1253',
    'cids' => 
    array (
    ),
  ),
  1970 => 
  array (
    'name' => '溯溪鞋',
    'pid' => '1890',
    'cids' => 
    array (
    ),
  ),
  1980 => 
  array (
    'name' => '足球服装',
    'pid' => '1251',
    'cids' => 
    array (
    ),
  ),
  1989 => 
  array (
    'name' => '排球鞋',
    'pid' => '1250',
    'cids' => 
    array (
    ),
  ),
  2022 => 
  array (
    'name' => '腰靠',
    'pid' => '2013',
    'cids' => 
    array (
    ),
  ),
  2055 => 
  array (
    'name' => '防盗设备',
    'pid' => '1256',
    'cids' => 
    array (
    ),
  ),
  2120 => 
  array (
    'name' => '油漆及辅料',
    'pid' => '2105',
    'cids' => 
    array (
    ),
  ),
  2147 => 
  array (
    'name' => '线帘',
    'pid' => '2138',
    'cids' => 
    array (
    ),
  ),
  185 => 
  array (
    'name' => '腕表珠宝',
    'pid' => '0',
    'cids' => 
    array (
      0 => 186,
      1 => 188,
    ),
  ),
  1395 => 
  array (
    'name' => '散粉',
    'pid' => '1384',
    'cids' => 
    array (
    ),
  ),
  1438 => 
  array (
    'name' => '剪刀',
    'pid' => '174',
    'cids' => 
    array (
    ),
  ),
  1457 => 
  array (
    'name' => '古典',
    'pid' => '1447',
    'cids' => 
    array (
    ),
  ),
  1472 => 
  array (
    'name' => '医疗保健',
    'pid' => '176',
    'cids' => 
    array (
    ),
  ),
  1488 => 
  array (
    'name' => '药盒',
    'pid' => '1478',
    'cids' => 
    array (
    ),
  ),
  1504 => 
  array (
    'name' => '护发',
    'pid' => '1494',
    'cids' => 
    array (
    ),
  ),
  1517 => 
  array (
    'name' => '手套',
    'pid' => '1509',
    'cids' => 
    array (
    ),
  ),
  1534 => 
  array (
    'name' => '烧烤',
    'pid' => '1474',
    'cids' => 
    array (
    ),
  ),
  1550 => 
  array (
    'name' => '瓶罐',
    'pid' => '1475',
    'cids' => 
    array (
    ),
  ),
  1563 => 
  array (
    'name' => '调理霜',
    'pid' => '1381',
    'cids' => 
    array (
    ),
  ),
  1589 => 
  array (
    'name' => '清火',
    'pid' => '163',
    'cids' => 
    array (
    ),
  ),
  1595 => 
  array (
    'name' => '餐具',
    'pid' => '164',
    'cids' => 
    array (
    ),
  ),
  1613 => 
  array (
    'name' => '积木',
    'pid' => '165',
    'cids' => 
    array (
    ),
  ),
  1625 => 
  array (
    'name' => '待产包',
    'pid' => '166',
    'cids' => 
    array (
    ),
  ),
  1633 => 
  array (
    'name' => '摇篮',
    'pid' => '1628',
    'cids' => 
    array (
    ),
  ),
  1659 => 
  array (
    'name' => '衬衫',
    'pid' => '223',
    'cids' => 
    array (
    ),
  ),
  1672 => 
  array (
    'name' => '啤酒',
    'pid' => '208',
    'cids' => 
    array (
    ),
  ),
  1683 => 
  array (
    'name' => '蔬果',
    'pid' => '209',
    'cids' => 
    array (
    ),
  ),
  1707 => 
  array (
    'name' => '麦片',
    'pid' => '1697',
    'cids' => 
    array (
    ),
  ),
  1723 => 
  array (
    'name' => '雪蛤',
    'pid' => '1713',
    'cids' => 
    array (
    ),
  ),
  1737 => 
  array (
    'name' => '贝系列',
    'pid' => '1693',
    'cids' => 
    array (
    ),
  ),
  1748 => 
  array (
    'name' => '花生仁',
    'pid' => '1694',
    'cids' => 
    array (
    ),
  ),
  1762 => 
  array (
    'name' => '蔬果干',
    'pid' => '1695',
    'cids' => 
    array (
    ),
  ),
  1775 => 
  array (
    'name' => '传统糕点',
    'pid' => '1696',
    'cids' => 
    array (
    ),
  ),
  1848 => 
  array (
    'name' => '音箱',
    'pid' => '1238',
    'cids' => 
    array (
    ),
  ),
  1900 => 
  array (
    'name' => '传记',
    'pid' => '1243',
    'cids' => 
    array (
    ),
  ),
  1921 => 
  array (
    'name' => '动画片',
    'pid' => '1241',
    'cids' => 
    array (
    ),
  ),
  1971 => 
  array (
    'name' => '户外羽绒服',
    'pid' => '1890',
    'cids' => 
    array (
    ),
  ),
  2023 => 
  array (
    'name' => '方向盘套',
    'pid' => '2013',
    'cids' => 
    array (
    ),
  ),
  2121 => 
  array (
    'name' => '瓷砖',
    'pid' => '2105',
    'cids' => 
    array (
    ),
  ),
  2148 => 
  array (
    'name' => '套巾',
    'pid' => '2138',
    'cids' => 
    array (
    ),
  ),
  206 => 
  array (
    'name' => '食品保健',
    'pid' => '0',
    'cids' => 
    array (
      0 => 208,
      1 => 207,
      2 => 209,
      3 => 210,
    ),
  ),
  1329 => 
  array (
    'name' => '天然水晶',
    'pid' => '118',
    'cids' => 
    array (
    ),
  ),
  1396 => 
  array (
    'name' => '彩妆盘',
    'pid' => '1384',
    'cids' => 
    array (
    ),
  ),
  1439 => 
  array (
    'name' => '梯子',
    'pid' => '174',
    'cids' => 
    array (
    ),
  ),
  1458 => 
  array (
    'name' => '欧美',
    'pid' => '1447',
    'cids' => 
    array (
    ),
  ),
  1473 => 
  array (
    'name' => '窝',
    'pid' => '176',
    'cids' => 
    array (
    ),
  ),
  1489 => 
  array (
    'name' => 'CD盒',
    'pid' => '1478',
    'cids' => 
    array (
    ),
  ),
  1505 => 
  array (
    'name' => '洗手液',
    'pid' => '1494',
    'cids' => 
    array (
    ),
  ),
  1518 => 
  array (
    'name' => '地板蜡',
    'pid' => '1509',
    'cids' => 
    array (
    ),
  ),
  1535 => 
  array (
    'name' => '铲',
    'pid' => '1474',
    'cids' => 
    array (
    ),
  ),
  1551 => 
  array (
    'name' => '饭盒',
    'pid' => '1475',
    'cids' => 
    array (
    ),
  ),
  1564 => 
  array (
    'name' => 'T区护理',
    'pid' => '1381',
    'cids' => 
    array (
    ),
  ),
  1590 => 
  array (
    'name' => '其它',
    'pid' => '163',
    'cids' => 
    array (
    ),
  ),
  1596 => 
  array (
    'name' => '学饮杯',
    'pid' => '164',
    'cids' => 
    array (
    ),
  ),
  1614 => 
  array (
    'name' => '儿童MP3',
    'pid' => '165',
    'cids' => 
    array (
    ),
  ),
  1626 => 
  array (
    'name' => '孕妇内衣',
    'pid' => '166',
    'cids' => 
    array (
    ),
  ),
  1660 => 
  array (
    'name' => '套装',
    'pid' => '223',
    'cids' => 
    array (
    ),
  ),
  1673 => 
  array (
    'name' => '果蔬汁',
    'pid' => '208',
    'cids' => 
    array (
    ),
  ),
  1684 => 
  array (
    'name' => '甲鱼',
    'pid' => '209',
    'cids' => 
    array (
    ),
  ),
  1708 => 
  array (
    'name' => '奶茶',
    'pid' => '1697',
    'cids' => 
    array (
    ),
  ),
  1724 => 
  array (
    'name' => '灵芝',
    'pid' => '1713',
    'cids' => 
    array (
    ),
  ),
  1738 => 
  array (
    'name' => '其他肉类',
    'pid' => '1693',
    'cids' => 
    array (
    ),
  ),
  1749 => 
  array (
    'name' => '腰果',
    'pid' => '1694',
    'cids' => 
    array (
    ),
  ),
  1763 => 
  array (
    'name' => '山楂制品',
    'pid' => '1695',
    'cids' => 
    array (
    ),
  ),
  1776 => 
  array (
    'name' => '西式糕点',
    'pid' => '1696',
    'cids' => 
    array (
    ),
  ),
  1849 => 
  array (
    'name' => '主板',
    'pid' => '1238',
    'cids' => 
    array (
    ),
  ),
  1901 => 
  array (
    'name' => '科普',
    'pid' => '1243',
    'cids' => 
    array (
    ),
  ),
  2045 => 
  array (
    'name' => '碟盒/碟包',
    'pid' => '2013',
    'cids' => 
    array (
    ),
  ),
  2122 => 
  array (
    'name' => '厨房装修',
    'pid' => '2105',
    'cids' => 
    array (
    ),
  ),
  2149 => 
  array (
    'name' => '配件类',
    'pid' => '2138',
    'cids' => 
    array (
    ),
  ),
  1239 => 
  array (
    'name' => '办公文教',
    'pid' => '0',
    'cids' => 
    array (
      0 => 1240,
      1 => 1823,
      2 => 1824,
    ),
  ),
  1330 => 
  array (
    'name' => '首饰盒',
    'pid' => '118',
    'cids' => 
    array (
    ),
  ),
  1397 => 
  array (
    'name' => '卸妆',
    'pid' => '1384',
    'cids' => 
    array (
    ),
  ),
  1440 => 
  array (
    'name' => '迷你扇',
    'pid' => '174',
    'cids' => 
    array (
    ),
  ),
  1459 => 
  array (
    'name' => '田园',
    'pid' => '1447',
    'cids' => 
    array (
    ),
  ),
  1490 => 
  array (
    'name' => '鞋柜',
    'pid' => '1478',
    'cids' => 
    array (
    ),
  ),
  1506 => 
  array (
    'name' => '护足',
    'pid' => '1494',
    'cids' => 
    array (
    ),
  ),
  1519 => 
  array (
    'name' => '除油污',
    'pid' => '1509',
    'cids' => 
    array (
    ),
  ),
  1536 => 
  array (
    'name' => '勺',
    'pid' => '1474',
    'cids' => 
    array (
    ),
  ),
  1552 => 
  array (
    'name' => '运动水壶',
    'pid' => '1475',
    'cids' => 
    array (
    ),
  ),
  1565 => 
  array (
    'name' => '去角质',
    'pid' => '1381',
    'cids' => 
    array (
    ),
  ),
  1597 => 
  array (
    'name' => '游泳池',
    'pid' => '164',
    'cids' => 
    array (
    ),
  ),
  1615 => 
  array (
    'name' => '绘画文具',
    'pid' => '165',
    'cids' => 
    array (
    ),
  ),
  1627 => 
  array (
    'name' => '妈咪包',
    'pid' => '166',
    'cids' => 
    array (
    ),
  ),
  1661 => 
  array (
    'name' => '凉鞋',
    'pid' => '223',
    'cids' => 
    array (
    ),
  ),
  1685 => 
  array (
    'name' => '大闸蟹',
    'pid' => '209',
    'cids' => 
    array (
    ),
  ),
  1709 => 
  array (
    'name' => '柚子茶',
    'pid' => '1697',
    'cids' => 
    array (
    ),
  ),
  1725 => 
  array (
    'name' => '冬虫夏草',
    'pid' => '1713',
    'cids' => 
    array (
    ),
  ),
  1750 => 
  array (
    'name' => '瓜子',
    'pid' => '1694',
    'cids' => 
    array (
    ),
  ),
  1764 => 
  array (
    'name' => '其他果干蜜饯',
    'pid' => '1695',
    'cids' => 
    array (
    ),
  ),
  1850 => 
  array (
    'name' => 'CPU',
    'pid' => '1238',
    'cids' => 
    array (
    ),
  ),
  1902 => 
  array (
    'name' => '管理',
    'pid' => '1243',
    'cids' => 
    array (
    ),
  ),
  1259 => 
  array (
    'name' => '文化玩乐',
    'pid' => '0',
    'cids' => 
    array (
      0 => 1260,
      1 => 1263,
      2 => 1262,
      3 => 2090,
    ),
  ),
  1331 => 
  array (
    'name' => '新娘饰品',
    'pid' => '118',
    'cids' => 
    array (
    ),
  ),
  1441 => 
  array (
    'name' => '浴室角架',
    'pid' => '174',
    'cids' => 
    array (
    ),
  ),
  1460 => 
  array (
    'name' => '宫廷',
    'pid' => '1447',
    'cids' => 
    array (
    ),
  ),
  1491 => 
  array (
    'name' => '购物袋',
    'pid' => '1478',
    'cids' => 
    array (
    ),
  ),
  1507 => 
  array (
    'name' => '香薰精油',
    'pid' => '1494',
    'cids' => 
    array (
    ),
  ),
  1520 => 
  array (
    'name' => '洁厕剂',
    'pid' => '1509',
    'cids' => 
    array (
    ),
  ),
  1537 => 
  array (
    'name' => '保鲜盒',
    'pid' => '1474',
    'cids' => 
    array (
    ),
  ),
  1553 => 
  array (
    'name' => '保温杯',
    'pid' => '1475',
    'cids' => 
    array (
    ),
  ),
  1598 => 
  array (
    'name' => '口水巾',
    'pid' => '164',
    'cids' => 
    array (
    ),
  ),
  1662 => 
  array (
    'name' => '宝宝服',
    'pid' => '223',
    'cids' => 
    array (
    ),
  ),
  1710 => 
  array (
    'name' => '保健茶',
    'pid' => '1697',
    'cids' => 
    array (
    ),
  ),
  1726 => 
  array (
    'name' => '药食同源',
    'pid' => '1713',
    'cids' => 
    array (
    ),
  ),
  1751 => 
  array (
    'name' => '豆类',
    'pid' => '1694',
    'cids' => 
    array (
    ),
  ),
  1851 => 
  array (
    'name' => '机箱',
    'pid' => '1238',
    'cids' => 
    array (
    ),
  ),
  1903 => 
  array (
    'name' => '法律',
    'pid' => '1243',
    'cids' => 
    array (
    ),
  ),
  1233 => 
  array (
    'name' => '3C数码',
    'pid' => '0',
    'cids' => 
    array (
      0 => 1234,
      1 => 1238,
      2 => 1821,
      3 => 1825,
    ),
  ),
  1332 => 
  array (
    'name' => '施华洛世奇水晶',
    'pid' => '118',
    'cids' => 
    array (
    ),
  ),
  1442 => 
  array (
    'name' => '足浴盆',
    'pid' => '174',
    'cids' => 
    array (
    ),
  ),
  1461 => 
  array (
    'name' => '酒店',
    'pid' => '1447',
    'cids' => 
    array (
    ),
  ),
  1492 => 
  array (
    'name' => '整理架',
    'pid' => '1478',
    'cids' => 
    array (
    ),
  ),
  1508 => 
  array (
    'name' => '指甲钳',
    'pid' => '1494',
    'cids' => 
    array (
    ),
  ),
  1521 => 
  array (
    'name' => '空气清新',
    'pid' => '1509',
    'cids' => 
    array (
    ),
  ),
  1538 => 
  array (
    'name' => '奶锅',
    'pid' => '1474',
    'cids' => 
    array (
    ),
  ),
  1554 => 
  array (
    'name' => '一次性用品',
    'pid' => '1475',
    'cids' => 
    array (
    ),
  ),
  1599 => 
  array (
    'name' => '浴盆',
    'pid' => '164',
    'cids' => 
    array (
    ),
  ),
  1663 => 
  array (
    'name' => '亲子装',
    'pid' => '223',
    'cids' => 
    array (
    ),
  ),
  1711 => 
  array (
    'name' => '柠檬片',
    'pid' => '1697',
    'cids' => 
    array (
    ),
  ),
  1727 => 
  array (
    'name' => '其他滋补',
    'pid' => '1713',
    'cids' => 
    array (
    ),
  ),
  1752 => 
  array (
    'name' => '其他',
    'pid' => '1694',
    'cids' => 
    array (
    ),
  ),
  1852 => 
  array (
    'name' => '内存',
    'pid' => '1238',
    'cids' => 
    array (
    ),
  ),
  1904 => 
  array (
    'name' => '建筑',
    'pid' => '1243',
    'cids' => 
    array (
    ),
  ),
  1224 => 
  array (
    'name' => '家用电器',
    'pid' => '0',
    'cids' => 
    array (
      0 => 1229,
      1 => 1230,
      2 => 1231,
      3 => 1232,
    ),
  ),
  1443 => 
  array (
    'name' => '相册',
    'pid' => '174',
    'cids' => 
    array (
    ),
  ),
  1462 => 
  array (
    'name' => '喜气',
    'pid' => '1447',
    'cids' => 
    array (
    ),
  ),
  1493 => 
  array (
    'name' => '卡包',
    'pid' => '1478',
    'cids' => 
    array (
    ),
  ),
  1522 => 
  array (
    'name' => '皮革保养',
    'pid' => '1509',
    'cids' => 
    array (
    ),
  ),
  1539 => 
  array (
    'name' => '调味瓶罐',
    'pid' => '1474',
    'cids' => 
    array (
    ),
  ),
  1600 => 
  array (
    'name' => '理发器',
    'pid' => '164',
    'cids' => 
    array (
    ),
  ),
  1712 => 
  array (
    'name' => '大麦茶',
    'pid' => '1697',
    'cids' => 
    array (
    ),
  ),
  1872 => 
  array (
    'name' => '硬盘',
    'pid' => '1238',
    'cids' => 
    array (
    ),
  ),
  1905 => 
  array (
    'name' => '考研',
    'pid' => '1243',
    'cids' => 
    array (
    ),
  ),
  1249 => 
  array (
    'name' => '运动户外',
    'pid' => '0',
    'cids' => 
    array (
      0 => 1250,
      1 => 1251,
      2 => 1252,
      3 => 1253,
    ),
  ),
  1444 => 
  array (
    'name' => '音乐盒',
    'pid' => '174',
    'cids' => 
    array (
    ),
  ),
  1601 => 
  array (
    'name' => '布尿裤',
    'pid' => '164',
    'cids' => 
    array (
    ),
  ),
  1906 => 
  array (
    'name' => '艺术',
    'pid' => '1243',
    'cids' => 
    array (
    ),
  ),
  1445 => 
  array (
    'name' => '钥匙扣',
    'pid' => '174',
    'cids' => 
    array (
    ),
  ),
  1602 => 
  array (
    'name' => '隔尿垫',
    'pid' => '164',
    'cids' => 
    array (
    ),
  ),
  2150 => 
  array (
    'name' => '医疗/计生',
    'pid' => '0',
    'cids' => 
    array (
      0 => 2159,
      1 => 2156,
      2 => 2160,
    ),
  ),
  1254 => 
  array (
    'name' => '汽车百货',
    'pid' => '0',
    'cids' => 
    array (
      0 => 1256,
      1 => 1255,
      2 => 1257,
      3 => 1258,
    ),
  ),
  1446 => 
  array (
    'name' => '烟缸',
    'pid' => '174',
    'cids' => 
    array (
    ),
  ),
  189 => 
  array (
    'name' => '眼镜火机',
    'pid' => '0',
    'cids' => 
    array (
      0 => 2087,
      1 => 1266,
      2 => 1268,
      3 => 2089,
    ),
  ),
  173 => 
  array (
    'name' => '厨房餐饮',
    'pid' => '0',
    'cids' => 
    array (
      0 => 1474,
      1 => 1475,
      2 => 1540,
    ),
  ),
  1477 => 
  array (
    'name' => '家装五金',
    'pid' => '0',
    'cids' => 
    array (
      0 => 2104,
      1 => 2105,
      2 => 2102,
      3 => 2103,
    ),
  ),
  2162 => 
  array (
    'name' => '护理液',
    'pid' => '2161',
    'cids' => 
    array (
    ),
  ),
);

?>